<?php

include 'config.inc.php';

/* Тестовые данные */
$str = '1. Иов.                 4:5,      6,      7; 8:1<br/>
2. Иова 4<br/>
3. Флм. 5 и Флм. 1:5<br/>
4. Иова 4:6 <br/>
5. Иова4:6а<br/>
6. Иова 4:6б<br/>
7. 1 Кор. 5:3-4<br/>
8. 1 Кор. 5:3&ndash;4 ndash<br/>
9. 1 Кор. 5:3&mdash;4 mdash<br/>
10. 1 Кор. 5:3-4 <br/>
11. 1 Кор. 5:3–4<br/>
12. 1 Кор. 5:3—4<br/>
13. 2 Кор 5:3-4 a<br/>
14. 2 Кор5:3-4<br/>
15. 2 Кор.5:3-4 a<br/>
16. 2 Кор.  5:3 - 4, 6,&nbsp;7,8,9<br/>
17. 2 Кор.&nbsp;5:3-4<br/>
18. 2 Кор. &nbsp;5:3-4<br/>
19. 2 Кор.&nbsp; 5:3-4<br/>
20. 2&nbsp;Кор.&nbsp;5:3-4<br/>
21. 2 Тим. 1:7 a<br/>
22. 2&nbsp;Кор. 5:3-4<br/>
23. 1 Цар. 5:3–4<br/>
24. 1 Кор. 5:3–4,6<br/>
25. 1 Кор. 5:3–4,6–7,8<br/>
26. 1 Кор. 5:3–4,6,7,8,9<br/>
27. Быт 1:2<br/>
28. Быт. 1:2<br/>
29. Бт 1:2<br/>
30. Книга Бытие 1:2<br/>
31. Четвертая книга Царств 1:2<br/>
32. Книга Судей Израилевых 1:2<br/>
33. Книга судей 1:2<br/>
34. II Кор. 5:3-4<br/>
35. I Цар. 17:34–41<br/>
36. I Паралипоменон 14:9<br/>
37. Исследуйте другие отрывки Числ. 13:26–33 Священного Писания, которые говорят о страхе. Бог Велик, Писание призывает верующих бояться только Его (Исх. 23:32,33; Числ. 13:26–33; 14:9; Втор. 31:12,13; 1 Цар. 17; 4 Цар. 17:34–41; Иов. 38–42; Пс. 22:4; 55:2–4; 61; 90; 118:120; 120; Притч. 10:24; 28:1; 29:25; Ис. 8:11–14; 51:7–8; 57:11; Иер. 17:5–10; Дан. 1,3,4,6; Мф. 10:28–39; Лк. 12:4,5; 1 Петр. 3:6,13,14; Рим. 8:15; 2 Тим. 1:7).<br/>
38. Исследуйте другие отрывки Священного Писания, которые говорят о страхе. Бог Велик, Писание призывает верующих бояться только Его (Исх.&nbsp;23:32,33; Числ. 13:26–33; 14:9; Втор.&nbsp;31:12,13; 1 Цар. 17; 4 Цар. 17:34–41; Иов. 38–42; Пс. 22:4; 55:2–4; 61; 90; 118:120; 120; Притч. 10:24; 28:1; 29:25; Ис.&nbsp;8:11&ndash;14; 51:7&ndash;8; 57:11; Иер. 17:5–10; Дан. 1,3,4,6; Мф. 10:28–39; Лк. 12:4,5; 1&nbsp;Петр.&nbsp;3:6,13,14; Рим. 8:15; 2 Тим. 1:7).<br/>
39. Через старейшин Откровение откровение проблемам<br/>
40. Проверка разделителей: Мф. 3:4–6,8 (рус.) и Мт. 3,4–6.8 (укр.)
<br/><br/>';
/* */

// Проверка на книгу из одной главы
function IsSingleChapterBook($index){
	$SingleChapterBooks = array('31'=>'31', '63'=>'63', '64'=>'64', '65'=>'65', '57'=>'57');
	return array_key_exists($index, $SingleChapterBooks);
}

// Определение номера книги по названию
function GetBibleBooks($type) {

	global $isRoman;
	global $languageIn;
	
	if ($languageIn == 'ua') {
		$BookByNameFull = array(
					'Бытие' 							=> '1',
					'Книга Бытие' 						=> '1',
					
					'Исход' 							=> '2',
					'Книга Исход' 						=> '2',
					
					'Левит' 							=> '3',
					'Книга Левит' 						=> '3',
					
					'Числа'								=> '4',
					'Книга Чисел'						=> '4',
					
					'Второзаконие' 						=> '5',
					'Книга Второзаконие' 				=> '5',
					
					'Иисус Навин' 						=> '6',
					'Книга Иисуса Навина' 				=> '6',
					'Книга Иисуса сына Навина' 			=> '6',
					'Книга Иисуса'						=> '6',
					
					'Книга Судей Израилевых'	 		=> '7',
					'Книга Судей' 						=> '7',
					
					'Книга Руфь' 						=> '8',
					
					'Первая книга Царств' 				=> '9',
					'Первая книга Самуила' 				=> '9',
					
					'Вторая книга Царств' 				=> '10',
					'Вторая книга Самуила' 				=> '10',
					
					'Третья книга Царств' 				=> '11',
					'Первая книга царей' 				=> '11',
					
					'Четвертая книга Царств' 			=> '12',
					'Вторая книга царей' 				=> '12',
					
					'Первый Паралипоменон' 				=> '13',
					'Первая Паралипоменон' 				=> '13',
					'Первая книга Паралипоменон' 		=> '13',
					'Первая книга хроник' 				=> '13',
					
					'Второй Паралипоменон'				=> '14',
					'Вторая Паралипоменон' 				=> '13',
					'Вторая книга Паралипоменон' 		=> '14',
					'Вторая книга хроник' 				=> '14',
					
					'Книга Ездры' 						=> '15',
					
					'Книга Неемии' 						=> '16',
					
					'Книга Есфирь' 						=> '17',
					
					'Книга Иова'						=> '18',
					
					'Книга Псалтырь' 					=> '19',
					'Книга Псалтирь' 					=> '19',
					'Книга Псалмов' 					=> '19',
					
					'Книга Притч Соломона' 				=> '20',
					'Книга Притч' 						=> '20',
					'Книга Притчей Соломона' 			=> '20',
					'Книга Притчей'						=> '20',
					
					'Книга Екклесиаста' 				=> '21',
					'Книга Екклезиаста' 				=> '21',
					'Книга Экклесиаста' 				=> '21',
					'Книга Экклезиаста' 				=> '21',
					
					'Книга Песнь Песней Соломона' 		=> '22',
					'Книга Песнь Песней' 				=> '22',
					
					'Книга Исайя' 						=> '23',
					'Книга Исайи' 						=> '23',
					'Книга Исаии' 						=> '23',
					'Книга пророка Исайя' 				=> '23',
					'Книга пророка Исайи' 				=> '23',
					'Книга пророка Исаии' 				=> '23',
					
					'Книга Иеремии' 					=> '24',
					'Книга пророка Иеремии' 			=> '24',
					
					'Плач Иеремии' 						=> '25',
					'Книга Плач Иеремии' 				=> '25',
					
					'Книга Иезекииля' 					=> '26',
					'Книга пророка Иезекииля' 			=> '26',
					
					'Книга Даниила' 					=> '27',
					'Книга пророка Даниила' 			=> '27',
					
					'Книга Осии' 						=> '28',
					'Книга пророка Осии' 				=> '28',
					
					'Книга Иоиль' 						=> '29',
					'Книга Иоиля' 						=> '29',
					'Книга пророка Иоиль' 				=> '29',
					
					'Книга Амоса'						=> '30',
					'Книга пророка Амоса' 				=> '30',
					
					'Книга Ионы' 						=> '32',
					'Книга пророка Ионы' 				=> '32',
					
					'Книга Михея' 						=> '33',
					'Книга пророка Михея' 				=> '33',
					
					'Книга Наума' 						=> '34',
					'Книга пророка Наума' 				=> '34',
					
					'Книга Аввакума' 					=> '35',
					'Книга пророка Аввакума' 			=> '35',
					
					'Книга Софонии' 					=> '36',
					'Книга пророка Софонии' 			=> '36',
					
					'Книга Аггея' 						=> '37',
					'Книга пророка Аггея' 				=> '37',
					
					'Книга Захарии' 					=> '38',
					'Книга пророка Захарии' 			=> '38',
					
					'Книга Малахии' 					=> '39',
					'Книга пророка Малахии' 			=> '39',
					
					'Евангелие по Матфею' 				=> '40',
					'Евангелие от Матфея' 				=> '40',
					'Евангелие Матфея' 					=> '40',
					
					'Евангелие по Марку' 				=> '41',
					'Евангелия от Марка' 				=> '41',
					'Евангелия Марка' 					=> '41',
					
					'Евангелие по Луке' 				=> '42',
					'Евангелие от Луки' 				=> '42',
					'Евангелие Луки' 					=> '42',
					
					'Евангелие по Иоанну' 				=> '43',
					'Евангелие от Иоанна' 				=> '43',
					'Евангелие Иоанна' 					=> '43',
					
					'Книга Деяния' 						=> '44',
					'Книга деяний апостолов' 			=> '44',
					'Деяния апостолов' 					=> '44',
					'Деятельность апостолов' 			=> '44',
					
					'Послание Иакова' 					=> '59',
					'Письмо Иакова' 					=> '59',
					
					'Первое послание Петра' 			=> '60',
					'Первое письмо Петра' 				=> '60',
					
					'Второе послание Петра' 			=> '61',
					'Второе письмо Петра' 				=> '61',
					
					'Первое послание Иоанна' 			=> '62',
					'Первое письмо Иоанна' 				=> '62',
					
					'Послание римлянам' 				=> '45',
					'Послание к римлянам' 				=> '45',
					'Письмо римлянам' 					=> '45',
					'Письмо к римлянам' 				=> '45',
					
					'Первое послание коринфянам' 		=> '46',
					'Первое послание к коринфянам'		=> '46',
					'Первое письмо коринфянам' 			=> '46',
					'Первое письмо к коринфянам'		=> '46',
					
					'Второе послание коринфянам' 		=> '47',
					'Второе послание к коринфянам' 		=> '47',
					'Второе письмо коринфянам' 			=> '47',
					'Второе письмо к коринфянам' 		=> '47',
					
					'Послание галатам' 					=> '48',
					'Послание к галатам' 				=> '48',
					'Письмо галатам' 					=> '48',
					'Письмо к галатам' 					=> '48',
					
					'Послание ефесянам' 				=> '49',
					'Послание эфесянам' 				=> '49',
					'Послание к ефесянам' 				=> '49',
					'Послание к эфесянам' 				=> '49',
					'Письмо ефесянам' 					=> '49',
					'Письмо эфесянам' 					=> '49',
					'Письмо к ефесянам' 				=> '49',
					'Письмо к эфесянам' 				=> '49',
					
					'Послание филиппийцам' 				=> '50',
					'Послание к филиппийцам' 			=> '50',
                    'Письмо филиппийцам' 				=> '50',
					'Письмо к филиппийцам' 				=> '50',
					
					'Послание колоссянам' 				=> '51',
					'Послание к колоссянам' 			=> '51',
					'Письмо колоссянам' 				=> '51',
					'Письмо к колоссянам' 				=> '51',
					
					'Первое послание фессалоникийцам' 	=> '52',
					'Первое послание к фессалоникийцам' => '52',
					'Первое письмо фессалоникийцам' 	=> '52',
					'Первое письмо к фессалоникийцам' 	=> '52',
					
					'Второе послание фессалоникийцам' 	=> '53',
					'Второе послание к фессалоникийцам' => '53',
					'Второе письмо фессалоникийцам' 	=> '53',
					'Второе письмо к фессалоникийцам'	=> '53',
					
					'Первое послание Тимофею' 			=> '54',
					'Первое послание к Тимофею' 		=> '54',
					'Первое письмо Тимофею' 			=> '54',
					'Первое письмо к Тимофею' 			=> '54',
					
					'Второе послание Тимофею' 			=> '55',
					'Второе послание к Тимофею' 		=> '55',
					'Второе письмо Тимофею' 			=> '55',
					'Второе письмо к Тимофею' 			=> '55',
					
					'Послание Титу' 					=> '56',
					'Послание к Титу' 					=> '56',
					'Письмо Титу' 						=> '56',
					'Письмо к Титу' 					=> '56',
					
					'Послание евреям' 					=> '58',
					'Послание к евреям' 				=> '58',
					'Письмо евреям' 					=> '58',
					'Письмо к евреям' 					=> '58',
					
					'Откровение Иоанна Богослова' 		=> '66',
					'Откровение Иоанна' 				=> '66',
					'Апокалипс Иоанна Богослова' 		=> '66',
					'Апокалипс Иоанна' 					=> '66',
					'Апокалипсис Иоанна Богослова' 		=> '66',
					'Апокалипсис Иоанна' 				=> '66',
					
					'Книга пророка Авдия' 				=> '31',
					
					'Послание Филимону' 				=> '57',
					'Послание к Филимону' 				=> '57',
					'Письмо Филимону' 					=> '57',
					'Письмо к Филимону' 				=> '57',
					
					'Второе послание Иоанна' 			=> '63',
					'Второе письмо Иоанна' 				=> '63',
					
					'Третье послание Иоанна' 			=> '64',
					'Третье письмо Иоанна' 				=> '64',
					
					'Послание Иуды' 					=> '65',
					'Письмо Иуды' 						=> '65',
					);
	
		$BookByNameShort = array(
					'Быт'					=> '1',
					'Бт'					=> '1',

					'Исх' 					=> '2',
					
					'Лев' 					=> '3',
					'Лв' 					=> '3',
					
					'Числ'					=> '4',
					'Чис'					=> '4',
					'Чс'					=> '4',
					
					'Втор'					=> '5',
					'Вт' 					=> '5',
					'Втрзк' 				=> '5',
					
					'Ис Нав'	 			=> '6',
					'Ис.Нав' 				=> '6',
					'Иис Нав' 				=> '6',
					'Иис.Нав'				=> '6',
					'Нав' 					=> '6',
					'Иисус' 				=> '6',
					'Ис' 					=> '6',
					
					'Сд' 					=> '7',
					'Суд' 					=> '7',
					'Судьи' 				=> '7',
					'Судей' 				=> '7',
					
					'Рф' 					=> '8',
					'Руф' 					=> '8',
					'Руфь' 					=> '8',
					'Руфи' 					=> '8',
					
					'1 Цар' 				=> '9',
					'1&nbsp;Цар' 			=> '9',
					'1Цар' 					=> '9',
					'1Цр'					=> '9',
					'1Ц'					=> '9',
					'1 Царств' 				=> '9',
					'1&nbsp;Царств' 		=> '9',
					'1Царств' 				=> '9',
					'1 Сам' 				=> '9',
					'1&nbsp;Сам' 			=> '9',
					'1Сам' 					=> '9',
					'1 Самуила' 			=> '9',
					'1&nbsp;Самуила' 		=> '9',
					
					'2 Цар' 				=> '10',
					'2&nbsp;Цар' 			=> '10',
					'2Цар' 					=> '10',
					'2Цр' 					=> '10',
					'2Ц' 					=> '10',
					'2 Царств' 				=> '10',
					'2&nbsp;Царств' 		=> '10',
					'2Царств' 				=> '10',
					'2 Сам' 				=> '10',
					'2&nbsp;Сам' 			=> '10',
					'2Сам' 					=> '10',
					'2 Самуила' 			=> '10',
					'2&nbsp;Самуила' 		=> '10',
					
					'3 Цар' 				=> '11',
					'3&nbsp;Цар' 			=> '11',
					'3Цар' 					=> '11',
					'3Цр' 					=> '11',
					'3Ц' 					=> '11',
					'3 Царств' 				=> '11',
					'3&nbsp;Царств' 		=> '11',
					'3Царств' 				=> '11',
					'1 Царей' 				=> '11',
					'1&nbsp;Царей' 			=> '11',
					'1Царей' 				=> '11',
					
					'4 Цар' 				=> '12',
					'4&nbsp;Цар' 			=> '12',
					'4Цар' 					=> '12',
					'4Цр' 					=> '12',
					'4Ц' 					=> '12',
					'4 Царств' 				=> '12',
					'4&nbsp;Царств' 		=> '12',
					'4Царств' 				=> '12',
					'2 Царей' 				=> '12',
					'2&nbsp;Царей' 			=> '12',
					'2Царей' 				=> '12',
					
					'1 Пар' 				=> '13',
					'1&nbsp;Пар' 			=> '13',
					'1Пар' 					=> '13',
					'1Пр' 					=> '13',
					'1 Паралипоменон' 		=> '13',
					'1&nbsp;Паралипоменон' 	=> '13',
					'1Паралипоменон' 		=> '13',
					'1 Хрон' 				=> '13',
					'1&nbsp;Хрон' 			=> '13',
					'1Хрон' 				=> '13',
					'1Хр' 					=> '13',
					'1 Хроник' 				=> '13',
					'1&nbsp;Хроник' 		=> '13',
					'1Хроник' 				=> '13',
					
					'2 Пар' 				=> '14',
					'2&nbsp;Пар' 			=> '14',
					'2Пар' 					=> '14',
					'2 Паралипоменон' 		=> '14',
					'2&nbsp;Паралипоменон' 	=> '14',
					'2Паралипоменон' 		=> '14',
					'2 Хрон' 				=> '14',
					'2&nbsp;Хрон' 			=> '14',
					'2Хрон' 				=> '14',
					'2Хр' 					=> '14',
					'2 Хроник' 				=> '14',
					'2&nbsp;Хроник' 		=> '14',
					'2Хроник' 				=> '14',
					
					'Ездр' 					=> '15',
					'Ез' 					=> '15',
					'Езд' 					=> '15',
					'Ездра' 				=> '15',
					'Ездры' 				=> '15',
					
					'Неем' 					=> '16',
					'Нм' 					=> '16',
					'Неемия' 				=> '16',
					'Неемии' 				=> '16',
					
					'Есф' 					=> '17',
					'Ес' 					=> '17',
					'Есфирь' 				=> '17',
					'Есфири' 				=> '17',
					
					'Иов' 					=> '18',
					'Ив' 					=> '18',
					'Иова' 					=> '18',
					
					'Пс' 					=> '19',
					'Псал' 					=> '19',
					'Псл' 					=> '19',
					'Псалт' 				=> '19',
					'Псалмы' 				=> '19',
					'Псалтирь'				=> '19',
					'Псалтырь' 				=> '19',
					'Псалом' 				=> '19',
					
					'Пр' 					=> '20',
					'Прит' 					=> '20',
					'Притч' 				=> '20',
					'Притчи' 				=> '20',
					'Притча' 				=> '20',
					
					'Екк' 					=> '21',
					'Экк' 					=> '21',
					'Ек' 					=> '21',
					'Эк' 					=> '21',
					'Екл' 					=> '21',
					'Экл' 					=> '21',
					'Екк' 					=> '21',
					'Экк' 					=> '21',
					'Еккл' 					=> '21',
					'Эккл' 					=> '21',
					'Екклесиаст' 			=> '21',
					'Екклезиаст' 			=> '21',
					'Экклесиаст' 			=> '21',
					'Экклезиаст' 			=> '21',
					'Екклесиаста' 			=> '21',
					'Екклезиаста' 			=> '21',
					'Экклесиаста' 			=> '21',
					'Экклезиаста' 			=> '21',
					
					'Песн' 					=> '22',
					'Пес' 					=> '22',
					'Псн' 					=> '22',
					'Песни' 				=> '22',
					'Песнь Песней' 			=> '22',
					'Песнь' 				=> '22',
					'Песн.Песней' 			=> '22',
					'Песн. Песней' 			=> '22',
					
					'Ис' 					=> '23',
					'Иса' 					=> '23',
					'Исайя' 				=> '23',
					'Исаия' 				=> '23',
					'Исайи' 				=> '23',
					'Исаии' 				=> '23',
					
					'Иер' 					=> '24',
					'Ир' 					=> '24',
					'Иерем' 				=> '24',
					'Иеремия' 				=> '24',
					
					'Плач' 					=> '25',
					'Пл' 					=> '25',
					'Плч' 					=> '25',
					'Пл. Иер' 				=> '25',
					'Пл.&nbsp;Иер' 			=> '25',
					'Пл.Иер' 				=> '25',
					'Иеремии' 				=> '25',
					
					'Из' 					=> '26',
					'Иез' 					=> '26',
					'Иезек' 				=> '26',
					'Иезекииль' 			=> '26',
					'Иезекииля' 			=> '26',
					
					'Дн' 					=> '27',
					'Дан' 					=> '27',
					'Днл' 					=> '27',
					'Даниил' 				=> '27',
					'Даниила' 				=> '27',
					
					'Ос' 					=> '28',
					'Осия' 					=> '28',
					'Осии' 					=> '28',
					
					'Иоил' 					=> '29',
					'Ил' 					=> '29',
					'Иоиль' 				=> '29',
					'Иоиля' 				=> '29',
					
					'Ам' 					=> '30',
					'Амс' 					=> '30',
					'Амос' 					=> '30',
					'Амоса' 				=> '30',
					
					'Иона' 					=> '32',
					'Ионы' 					=> '32',
					'Ион' 					=> '32',
					
					'Мх' 					=> '33',
					'Мих' 					=> '33',
					'Михей' 				=> '33',
					'Михея' 				=> '33',
					
					'Наум' 					=> '34',
					'Наума' 				=> '34',
					
					'Ав' 					=> '35',
					'Авв' 					=> '35',
					'Аввак' 				=> '35',
					'Аввакум' 				=> '35',
					'Аввакума' 				=> '35',
					
					'Соф' 					=> '36',
					'Сф' 					=> '36',
					'Софон' 				=> '36',
					'Софония' 				=> '36',
					'Софонии' 				=> '36',
					
					'Аг' 					=> '37',
					'Агг' 					=> '37',
					'Аггей' 				=> '37',
					'Аггея' 				=> '37',
					
					'Зах' 					=> '38',
					'Зхр' 					=> '38',
					'Захар' 				=> '38',
					'Захария' 				=> '38',
					'Захарии' 				=> '38',
					
					'Мал' 					=> '39',
					'Мл' 					=> '39',
					'Млх' 					=> '39',
					'Малах' 				=> '39',
					'Малахия' 				=> '39',
					'Малахии' 				=> '39',
					
					'Мф' 					=> '40',
					'Мат' 					=> '40',
					'Мтф' 					=> '40',
					'Мт' 					=> '40',
					'Матф' 					=> '40',
					'Матфея' 				=> '40',
					'Матфей' 				=> '40',
					
					'Мк' 					=> '41',
					'Мар' 					=> '41',
					'Мр' 					=> '41',
					'Мрк' 					=> '41',
					'Марк' 					=> '41',
					'Марка' 				=> '41',
					
					'Лк' 					=> '42',
					'Лук' 					=> '42',
					'Лука' 					=> '42',
					'Луки' 					=> '42',
					
					'Ин' 					=> '43',
					'Иоан' 					=> '43',
					'Иоанн' 				=> '43',
					'Иоанна' 				=> '43',
					
					'Деян' 					=> '44',
					'Дея' 					=> '44',
					'Д.А' 					=> '44',
					'Деяния' 				=> '44',
					
					'Иак' 					=> '59',
					'Ик' 					=> '59',
					'Иаков' 				=> '59',
					'Иакова' 				=> '59',
					
					'1 Пет' 				=> '60',
					'1&nbsp;Пет' 			=> '60',
					'1Пет' 					=> '60',
					'1 Пт' 					=> '60',
					'1&nbsp;Пт' 			=> '60',
					'1Пт' 					=> '60',
					'1 Птр' 				=> '60',
					'1&nbsp;Птр' 			=> '60',
					'1Птр' 					=> '60',
					'1 Петр' 				=> '60',
					'1&nbsp;Петр' 			=> '60',
					'1Петр' 				=> '60',
					'1 Петра' 				=> '60',
					'1&nbsp;Петра' 			=> '60',
					'1Петра' 				=> '60',
					
					'2 Пет' 				=> '61',
					'2&nbsp;Пет' 			=> '61',
					'2Пет' 					=> '61',
					'2 Пт' 					=> '61',
					'2&nbsp;Пт' 			=> '61',
					'2Пт' 					=> '61',
					'2 Птр' 				=> '61',
					'2&nbsp;Птр' 			=> '61',
					'2Птр' 					=> '61',
					'2 Петр' 				=> '61',
					'2&nbsp;Петр' 			=> '61',
					'2Петр' 				=> '61',
					'2 Петра' 				=> '61',
					'2&nbsp;Петра' 			=> '61',
					'2Петра' 				=> '61',
					
					'1 Ин' 					=> '62',
					'1&nbsp;Ин' 			=> '62',
					'1Ин' 					=> '62',
					'1 Иоан' 				=> '62',
					'1&nbsp;Иоан' 			=> '62',
					'1Иоан' 				=> '62',
					'1 Иоанн' 				=> '62',
					'1&nbsp;Иоанн' 			=> '62',
					'1Иоанн' 				=> '62',
					'1 Иоанна' 				=> '62',
					'1&nbsp;Иоанна' 		=> '62',
					'1Иоанна' 				=> '62',
					
					'Рим' 					=> '45',
					'Римл' 					=> '45',
					'Римлянам' 				=> '45',
					
					'1 Кор' 				=> '46',
					'1&nbsp;Кор' 			=> '46',
					'1Кор' 					=> '46',
					'1 Коринф' 				=> '46',
					'1&nbsp;Коринф' 		=> '46',
					'1Коринф' 				=> '46',
					'1 Коринфянам' 			=> '46',
					'1&nbsp;Коринфянам' 	=> '46',
					'1Коринфянам' 			=> '46',
					
					'2 Кор' 				=> '47',
					'2&nbsp;Кор' 			=> '47',
					'2Кор' 					=> '47',
					'2 Коринф' 				=> '47',
					'2&nbsp;Коринф' 		=> '47',
					'2Коринф' 				=> '47',
					'2 Коринфянам' 			=> '47',
					'2&nbsp;Коринфянам' 	=> '47',
					'2Коринфянам' 			=> '47',
					
					'Гал' 					=> '48',
					'Галат' 				=> '48',
					'Галатам' 				=> '48',
					
					'Еф' 					=> '49',
					'Эф' 					=> '49',
					'Ефес' 					=> '49',
					'Эфес' 					=> '49',
					'Ефесянам' 				=> '49',
					'Эфесянам' 				=> '49',
					
					'Флп' 					=> '50',
					'Фил' 					=> '50',
					'Филип' 				=> '50',
					'Филиппийцам' 			=> '50',
                    
					'Кол' 					=> '51',
					'Кл' 					=> '51',
					'Колос' 				=> '51',
					'Колоссянам' 			=> '51',
					
					'1 Фес' 				=> '52',
					'1&nbsp;Фес' 			=> '52',
					'1Фес' 					=> '52',
					'1 Фесс' 				=> '52',
					'1&nbsp;Фесс' 			=> '52',
					'1Фесс' 				=> '52',
					'1 Фессалоникийцам' 	=> '52',
					'1&nbsp;Фессалоникийцам' => '52',
					'1Фессалоникийцам' 		=> '52',
					
					
					'2 Фес' 				=> '53',
					'2&nbsp;Фес' 			=> '53',
					'2Фес' 					=> '53',
					'2 Фесс' 				=> '53',
					'2&nbsp;Фесс' 			=> '53',
					'2Фесс' 				=> '53',
					'2 Фессалоникийцам' 	=> '53',
					'2&nbsp;Фессалоникийцам' => '53',
					'2Фессалоникийцам' 		=> '53',
					
					'1 Тим' 				=> '54',
					'1&nbsp;Тим' 			=> '54',
					'1Тим' 					=> '54',
					'1 Тимоф' 				=> '54',
					'1&nbsp;Тимоф' 			=> '54',
					'1Тимоф' 				=> '54',
					'1 Тимофею' 			=> '54',
					'1&nbsp;Тимофею' 		=> '54',
					'1Тимофею' 				=> '54',
					'1 Тимофея' 			=> '54',
					'1&nbsp;Тимофея' 		=> '54',
					'1Тимофея' 				=> '54',
					
					'2 Тим' 				=> '55',
					'2&nbsp;Тим' 			=> '55',
					'2Тим' 					=> '55',
					'2 Тимоф' 				=> '55',
					'2&nbsp;Тимоф' 			=> '55',
					'2Тимоф' 				=> '55',
					'2 Тимофею' 			=> '55',
					'2&nbsp;Тимофею' 		=> '55',
					'2Тимофею' 				=> '55',
					'2 Тимофея' 			=> '55',
					'2&nbsp;Тимофея' 		=> '55',
					'2Тимофея' 				=> '55',
					
					'Тит' 					=> '56',
					'Титу' 					=> '56',
					
					'Евр' 					=> '58',
					'Евреям' 				=> '58',
					
					'Откр' 					=> '66',
					'Отк' 					=> '66',
					'Откровен' 				=> '66',
					'Откровение' 			=> '66',
					'Апокалипс'				=> '66',
					'Апокалипсис'			=> '66',
					
					'Ав' 					=> '31',
					'Авд' 					=> '31',
					'Адвий' 				=> '31',
					'Адвия' 				=> '31',
					
					'Флм' 					=> '57',
					'Филим' 				=> '57',
					'Филимон' 				=> '57',
					'Филимону' 				=> '57',
					
					'2 Ин' 					=> '63',
					'2&nbsp;Ин' 			=> '63',
					'2Ин' 					=> '63',
					'2 Иоан' 				=> '63',
					'2&nbsp;Иоан' 			=> '63',
					'2Иоан' 				=> '63',
					'2 Иоанн' 				=> '63',
					'2&nbsp;Иоанн' 			=> '63',
					'2Иоанн' 				=> '63',
					'2 Иоанна' 				=> '63',
					'2&nbsp;Иоанна' 		=> '63',
					'2Иоанна' 				=> '63',
					
					'3 Ин' 					=> '64',
					'3&nbsp;Ин' 			=> '64',
					'3Ин' 					=> '64',
					'3 Иоан' 				=> '64',
					'3&nbsp;Иоан' 			=> '64',
					'3Иоан' 				=> '64',
					'3 Иоанн' 				=> '64',
					'3&nbsp;Иоанн' 			=> '64',
					'3Иоанн' 				=> '64',
					'3 Иоанна' 				=> '64',
					'3&nbsp;Иоанна' 		=> '64',
					'3Иоанна' 				=> '64',
					
					'Иуд' 					=> '65',
					'Ид' 					=> '65',
					'Иуда' 					=> '65',
					'Иуды' 					=> '65',
					);
	
		$BookByNameRoman = array(
					'I Цар' 				=> '9',
					'I&nbsp;Цар' 			=> '9',
					'IЦар' 					=> '9',
					'IЦр'					=> '9',
					'IЦ'					=> '9',
					'I Царств' 				=> '9',
					'I&nbsp;Царств' 		=> '9',
					'IЦарств' 				=> '9',
					'I Сам' 				=> '9',
					'I&nbsp;Сам' 			=> '9',
					'IСам' 					=> '9',
					'I Самуила' 			=> '9',
					'I&nbsp;Самуила' 		=> '9',
					
					'II Цар' 				=> '10',
					'II&nbsp;Цар' 			=> '10',
					'IIЦар' 				=> '10',
					'IIЦр' 					=> '10',
					'IIЦ' 					=> '10',
					'II Царств' 			=> '10',
					'II&nbsp;Царств' 		=> '10',
					'IIЦарств' 				=> '10',
					'II Сам' 				=> '10',
					'II&nbsp;Сам' 			=> '10',
					'IIСам' 				=> '10',
					'II Самуила' 			=> '10',
					'II&nbsp;Самуила' 		=> '10',
					
					'III Цар' 				=> '11',
					'III&nbsp;Цар' 			=> '11',
					'IIIЦар' 				=> '11',
					'IIIЦр' 				=> '11',
					'IIIЦ' 					=> '11',
					'III Царств' 			=> '11',
					'III&nbsp;Царств' 		=> '11',
					'IIIЦарств' 			=> '11',
					'I Царей' 				=> '11',
					'I&nbsp;Царей' 			=> '11',
					'IЦарей' 				=> '11',
					
					'IV Цар' 				=> '12',
					'IV&nbsp;Цар' 			=> '12',
					'IVЦар' 				=> '12',
					'IVЦр' 					=> '12',
					'IVЦ' 					=> '12',
					'IV Царств' 			=> '12',
					'IV&nbsp;Царств' 		=> '12',
					'IVЦарств' 				=> '12',
					'II Царей' 				=> '12',
					'II&nbsp;Царей' 		=> '12',
					'IIЦарей' 				=> '12',
					
					'I Пар' 				=> '13',
					'I&nbsp;Пар' 			=> '13',
					'IПар' 					=> '13',
					'IПр' 					=> '13',
					'I Паралипоменон' 		=> '13',
					'I&nbsp;Паралипоменон' 	=> '13',
					'IПаралипоменон' 		=> '13',
					'I Хрон' 				=> '13',
					'I&nbsp;Хрон' 			=> '13',
					'IХрон' 				=> '13',
					'IХр' 					=> '13',
					'I Хроник' 				=> '13',
					
					'II Пар' 				=> '14',
					'II&nbsp;Пар' 			=> '14',
					'IIПар' 				=> '14',
					'II Паралипоменон' 		=> '14',
					'II&nbsp;Паралипоменон' => '14',
					'IIПаралипоменон' 		=> '14',
					'II Хрон' 				=> '14',
					'II&nbsp;Хрон' 			=> '14',
					'IIХрон' 				=> '14',
					'IIХр' 					=> '14',
					'II Хроник' 			=> '14',
					
					'I Пет' 				=> '60',
					'I&nbsp;Пет' 			=> '60',
					'IПет' 					=> '60',
					'I Пт' 					=> '60',
					'I&nbsp;Пт' 			=> '60',
					'IПт' 					=> '60',
					'I Птр' 				=> '60',
					'I&nbsp;Птр' 			=> '60',
					'IПтр' 					=> '60',
					'I Петр' 				=> '60',
					'I&nbsp;Петр' 			=> '60',
					'IПетр' 				=> '60',
					'I Петра' 				=> '60',
					'I&nbsp;Петра' 			=> '60',
					'IПетра' 				=> '60',
					
					'II Пет' 				=> '61',
					'II&nbsp;Пет' 			=> '61',
					'IIПет' 				=> '61',
					'II Пт' 				=> '61',
					'II&nbsp;Пт' 			=> '61',
					'IIПт' 					=> '61',
					'II Птр' 				=> '61',
					'II&nbsp;Птр' 			=> '61',
					'IIПтр' 				=> '61',
					'II Петр' 				=> '61',
					'II&nbsp;Петр' 			=> '61',
					'IIПетр' 				=> '61',
					'II Петра' 				=> '61',
					'II&nbsp;Петра' 		=> '61',
					'IIПетра' 				=> '61',
					
					'I Ин' 					=> '62',
					'I&nbsp;Ин' 			=> '62',
					'IИн' 					=> '62',
					'I Иоан' 				=> '62',
					'I&nbsp;Иоан' 			=> '62',
					'IИоан' 				=> '62',
					'I Иоанн' 				=> '62',
					'I&nbsp;Иоанн' 			=> '62',
					'IИоанн' 				=> '62',
					'I Иоанна' 				=> '62',
					'I&nbsp;Иоанна' 		=> '62',
					'IИоанна' 				=> '62',
					
					'I Кор' 				=> '46',
					'I&nbsp;Кор' 			=> '46',
					'IКор' 					=> '46',
					'I Коринф' 				=> '46',
					'I&nbsp;Коринф' 		=> '46',
					'IКоринф' 				=> '46',
					'I Коринфянам' 			=> '46',
					'I&nbsp;Коринфянам' 	=> '46',
					'IКоринфянам' 			=> '46',
					
					'II Кор' 				=> '47',
					'II&nbsp;Кор' 			=> '47',
					'IIКор' 				=> '47',
					'II Коринф' 			=> '47',
					'II&nbsp;Коринф' 		=> '47',
					'IIКоринф' 				=> '47',
					'II Коринфянам' 		=> '47',
					'II&nbsp;Коринфянам' 	=> '47',
					'IIКоринфянам' 			=> '47',
					
					'I Фес' 				=> '52',
					'I&nbsp;Фес' 			=> '52',
					'IФес' 					=> '52',
					'I Фесс' 				=> '52',
					'I&nbsp;Фесс' 			=> '52',
					'IФесс' 				=> '52',
					'I Фессалоникийцам' 	=> '52',
					'I&nbsp;Фессалоникийцам' => '52',
					'IФессалоникийцам' 		=> '52',
					
					'II Фес' 				=> '53',
					'II&nbsp;Фес' 			=> '53',
					'IIФес' 				=> '53',
					'II Фесс' 				=> '53',
					'II&nbsp;Фесс' 			=> '53',
					'IIФесс' 				=> '53',
					'II Фессалоникийцам' 	=> '53',
					'II&nbsp;Фессалоникийцам' => '53',
					'IIФессалоникийцам' 	=> '53',
					
					'I Тим' 				=> '54',
					'I&nbsp;Тим' 			=> '54',
					'IТим' 					=> '54',
					'I Тимоф' 				=> '54',
					'I&nbsp;Тимоф' 			=> '54',
					'IТимоф' 				=> '54',
					'I Тимофею' 			=> '54',
					'I&nbsp;Тимофею' 		=> '54',
					'IТимофею' 				=> '54',
					'I Тимофея' 			=> '54',
					'I&nbsp;Тимофея' 		=> '54',
					'IТимофея' 				=> '54',
					
					'II Тим' 				=> '55',
					'II&nbsp;Тим' 			=> '55',
					'IIТим' 				=> '55',
					'II Тимоф' 				=> '55',
					'II&nbsp;Тимоф' 		=> '55',
					'IIТимоф' 				=> '55',
					'II Тимофею' 			=> '55',
					'II&nbsp;Тимофею' 		=> '55',
					'IIТимофею' 			=> '55',
					'II Тимофея' 			=> '55',
					'II&nbsp;Тимофея' 		=> '55',
					'IIТимофея' 			=> '55',
					
					'II Ин' 				=> '63',
					'II&nbsp;Ин' 			=> '63',
					'IIИн' 					=> '63',
					'II Иоан' 				=> '63',
					'II&nbsp;Иоан' 			=> '63',
					'IIИоан' 				=> '63',
					'II Иоанн' 				=> '63',
					'II&nbsp;Иоанн' 		=> '63',
					'IIИоанн' 				=> '63',
					'II Иоанна' 			=> '63',
					'II&nbsp;Иоанна' 		=> '63',
					'IIИоанна' 				=> '63',
					
					'III Ин' 				=> '64',
					'III&nbsp;Ин' 			=> '64',
					'IIIИн' 				=> '64',
					'III Иоан' 				=> '64',
					'III&nbsp;Иоан' 		=> '64',
					'IIIИоан' 				=> '64',
					'III Иоанн' 			=> '64',
					'III&nbsp;Иоанн' 		=> '64',
					'IIIИоанн' 				=> '64',
					'III Иоанна' 			=> '64',
					'III&nbsp;Иоанна' 		=> '64',
					'IIIИоанна' 			=> '64',
					);
	} else {
		$BookByNameFull = array(
					'Бытие' 							=> '1',
					'Книга Бытие' 						=> '1',
					
					'Исход' 							=> '2',
					'Книга Исход' 						=> '2',
					
					'Левит' 							=> '3',
					'Книга Левит' 						=> '3',
					
					'Числа'								=> '4',
					'Книга Чисел'						=> '4',
					
					'Второзаконие' 						=> '5',
					'Книга Второзаконие' 				=> '5',
					
					'Иисус Навин' 						=> '6',
					'Книга Иисуса Навина' 				=> '6',
					'Книга Иисуса сына Навина' 			=> '6',
					'Книга Иисуса'						=> '6',
					
					'Книга Судей Израилевых'	 		=> '7',
					'Книга Судей' 						=> '7',
					
					'Книга Руфь' 						=> '8',
					
					'Первая книга Царств' 				=> '9',
					'Первая книга Самуила' 				=> '9',
					
					'Вторая книга Царств' 				=> '10',
					'Вторая книга Самуила' 				=> '10',
					
					'Третья книга Царств' 				=> '11',
					'Первая книга царей' 				=> '11',
					
					'Четвертая книга Царств' 			=> '12',
					'Вторая книга царей' 				=> '12',
					
					'Первый Паралипоменон' 				=> '13',
					'Первая Паралипоменон' 				=> '13',
					'Первая книга Паралипоменон' 		=> '13',
					'Первая книга хроник' 				=> '13',
					
					'Второй Паралипоменон'				=> '14',
					'Вторая Паралипоменон' 				=> '13',
					'Вторая книга Паралипоменон' 		=> '14',
					'Вторая книга хроник' 				=> '14',
					
					'Книга Ездры' 						=> '15',
					
					'Книга Неемии' 						=> '16',
					
					'Книга Есфирь' 						=> '17',
					
					'Книга Иова'						=> '18',
					
					'Книга Псалтырь' 					=> '19',
					'Книга Псалтирь' 					=> '19',
					'Книга Псалмов' 					=> '19',
					
					'Книга Притч Соломона' 				=> '20',
					'Книга Притч' 						=> '20',
					'Книга Притчей Соломона' 			=> '20',
					'Книга Притчей'						=> '20',
					
					'Книга Екклесиаста' 				=> '21',
					'Книга Екклезиаста' 				=> '21',
					'Книга Экклесиаста' 				=> '21',
					'Книга Экклезиаста' 				=> '21',
					
					'Книга Песнь Песней Соломона' 		=> '22',
					'Книга Песнь Песней' 				=> '22',
					
					'Книга Исайя' 						=> '23',
					'Книга Исайи' 						=> '23',
					'Книга Исаии' 						=> '23',
					'Книга пророка Исайя' 				=> '23',
					'Книга пророка Исайи' 				=> '23',
					'Книга пророка Исаии' 				=> '23',
					
					'Книга Иеремии' 					=> '24',
					'Книга пророка Иеремии' 			=> '24',
					
					'Плач Иеремии' 						=> '25',
					'Книга Плач Иеремии' 				=> '25',
					
					'Книга Иезекииля' 					=> '26',
					'Книга пророка Иезекииля' 			=> '26',
					
					'Книга Даниила' 					=> '27',
					'Книга пророка Даниила' 			=> '27',
					
					'Книга Осии' 						=> '28',
					'Книга пророка Осии' 				=> '28',
					
					'Книга Иоиль' 						=> '29',
					'Книга Иоиля' 						=> '29',
					'Книга пророка Иоиль' 				=> '29',
					
					'Книга Амоса'						=> '30',
					'Книга пророка Амоса' 				=> '30',
					
					'Книга Ионы' 						=> '32',
					'Книга пророка Ионы' 				=> '32',
					
					'Книга Михея' 						=> '33',
					'Книга пророка Михея' 				=> '33',
					
					'Книга Наума' 						=> '34',
					'Книга пророка Наума' 				=> '34',
					
					'Книга Аввакума' 					=> '35',
					'Книга пророка Аввакума' 			=> '35',
					
					'Книга Софонии' 					=> '36',
					'Книга пророка Софонии' 			=> '36',
					
					'Книга Аггея' 						=> '37',
					'Книга пророка Аггея' 				=> '37',
					
					'Книга Захарии' 					=> '38',
					'Книга пророка Захарии' 			=> '38',
					
					'Книга Малахии' 					=> '39',
					'Книга пророка Малахии' 			=> '39',
					
					'Евангелие по Матфею' 				=> '40',
					'Евангелие от Матфея' 				=> '40',
					'Евангелие Матфея' 					=> '40',
					
					'Евангелие по Марку' 				=> '41',
					'Евангелия от Марка' 				=> '41',
					'Евангелия Марка' 					=> '41',
					
					'Евангелие по Луке' 				=> '42',
					'Евангелие от Луки' 				=> '42',
					'Евангелие Луки' 					=> '42',
					
					'Евангелие по Иоанну' 				=> '43',
					'Евангелие от Иоанна' 				=> '43',
					'Евангелие Иоанна' 					=> '43',
					
					'Книга Деяния' 						=> '44',
					'Книга деяний апостолов' 			=> '44',
					'Деяния апостолов' 					=> '44',
					'Деятельность апостолов' 			=> '44',
					
					'Послание Иакова' 					=> '59',
					'Письмо Иакова' 					=> '59',
					
					'Первое послание Петра' 			=> '60',
					'Первое письмо Петра' 				=> '60',
					
					'Второе послание Петра' 			=> '61',
					'Второе письмо Петра' 				=> '61',
					
					'Первое послание Иоанна' 			=> '62',
					'Первое письмо Иоанна' 				=> '62',
					
					'Послание римлянам' 				=> '45',
					'Послание к римлянам' 				=> '45',
					'Письмо римлянам' 					=> '45',
					'Письмо к римлянам' 				=> '45',
					
					'Первое послание коринфянам' 		=> '46',
					'Первое послание к коринфянам'		=> '46',
					'Первое письмо коринфянам' 			=> '46',
					'Первое письмо к коринфянам'		=> '46',
					
					'Второе послание коринфянам' 		=> '47',
					'Второе послание к коринфянам' 		=> '47',
					'Второе письмо коринфянам' 			=> '47',
					'Второе письмо к коринфянам' 		=> '47',
					
					'Послание галатам' 					=> '48',
					'Послание к галатам' 				=> '48',
					'Письмо галатам' 					=> '48',
					'Письмо к галатам' 					=> '48',
					
					'Послание ефесянам' 				=> '49',
					'Послание эфесянам' 				=> '49',
					'Послание к ефесянам' 				=> '49',
					'Послание к эфесянам' 				=> '49',
					'Письмо ефесянам' 					=> '49',
					'Письмо эфесянам' 					=> '49',
					'Письмо к ефесянам' 				=> '49',
					'Письмо к эфесянам' 				=> '49',
					
					'Послание филиппийцам' 				=> '50',
					'Послание к филиппийцам' 			=> '50',
                    'Письмо филиппийцам' 				=> '50',
					'Письмо к филиппийцам' 				=> '50',
					
					'Послание колоссянам' 				=> '51',
					'Послание к колоссянам' 			=> '51',
					'Письмо колоссянам' 				=> '51',
					'Письмо к колоссянам' 				=> '51',
					
					'Первое послание фессалоникийцам' 	=> '52',
					'Первое послание к фессалоникийцам' => '52',
					'Первое письмо фессалоникийцам' 	=> '52',
					'Первое письмо к фессалоникийцам' 	=> '52',
					
					'Второе послание фессалоникийцам' 	=> '53',
					'Второе послание к фессалоникийцам' => '53',
					'Второе письмо фессалоникийцам' 	=> '53',
					'Второе письмо к фессалоникийцам'	=> '53',
					
					'Первое послание Тимофею' 			=> '54',
					'Первое послание к Тимофею' 		=> '54',
					'Первое письмо Тимофею' 			=> '54',
					'Первое письмо к Тимофею' 			=> '54',
					
					'Второе послание Тимофею' 			=> '55',
					'Второе послание к Тимофею' 		=> '55',
					'Второе письмо Тимофею' 			=> '55',
					'Второе письмо к Тимофею' 			=> '55',
					
					'Послание Титу' 					=> '56',
					'Послание к Титу' 					=> '56',
					'Письмо Титу' 						=> '56',
					'Письмо к Титу' 					=> '56',
					
					'Послание евреям' 					=> '58',
					'Послание к евреям' 				=> '58',
					'Письмо евреям' 					=> '58',
					'Письмо к евреям' 					=> '58',
					
					'Откровение Иоанна Богослова' 		=> '66',
					'Откровение Иоанна' 				=> '66',
					'Апокалипс Иоанна Богослова' 		=> '66',
					'Апокалипс Иоанна' 					=> '66',
					'Апокалипсис Иоанна Богослова' 		=> '66',
					'Апокалипсис Иоанна' 				=> '66',
					
					'Книга пророка Авдия' 				=> '31',
					
					'Послание Филимону' 				=> '57',
					'Послание к Филимону' 				=> '57',
					'Письмо Филимону' 					=> '57',
					'Письмо к Филимону' 				=> '57',
					
					'Второе послание Иоанна' 			=> '63',
					'Второе письмо Иоанна' 				=> '63',
					
					'Третье послание Иоанна' 			=> '64',
					'Третье письмо Иоанна' 				=> '64',
					
					'Послание Иуды' 					=> '65',
					'Письмо Иуды' 						=> '65',
					);
	
		$BookByNameShort = array(
					'Быт'					=> '1',
					'Бт'					=> '1',

					'Исх' 					=> '2',
					
					'Лев' 					=> '3',
					'Лв' 					=> '3',
					
					'Числ'					=> '4',
					'Чис'					=> '4',
					'Чс'					=> '4',
					
					'Втор'					=> '5',
					'Вт' 					=> '5',
					'Втрзк' 				=> '5',
					
					'Ис Нав'	 			=> '6',
					'Ис.Нав' 				=> '6',
					'Иис Нав' 				=> '6',
					'Иис.Нав'				=> '6',
					'Нав' 					=> '6',
					'Иисус' 				=> '6',
					'Ис' 					=> '6',
					
					'Сд' 					=> '7',
					'Суд' 					=> '7',
					'Судьи' 				=> '7',
					'Судей' 				=> '7',
					
					'Рф' 					=> '8',
					'Руф' 					=> '8',
					'Руфь' 					=> '8',
					'Руфи' 					=> '8',
					
					'1 Цар' 				=> '9',
					'1&nbsp;Цар' 			=> '9',
					'1Цар' 					=> '9',
					'1Цр'					=> '9',
					'1Ц'					=> '9',
					'1 Царств' 				=> '9',
					'1&nbsp;Царств' 		=> '9',
					'1Царств' 				=> '9',
					'1 Сам' 				=> '9',
					'1&nbsp;Сам' 			=> '9',
					'1Сам' 					=> '9',
					'1 Самуила' 			=> '9',
					'1&nbsp;Самуила' 		=> '9',
					
					'2 Цар' 				=> '10',
					'2&nbsp;Цар' 			=> '10',
					'2Цар' 					=> '10',
					'2Цр' 					=> '10',
					'2Ц' 					=> '10',
					'2 Царств' 				=> '10',
					'2&nbsp;Царств' 		=> '10',
					'2Царств' 				=> '10',
					'2 Сам' 				=> '10',
					'2&nbsp;Сам' 			=> '10',
					'2Сам' 					=> '10',
					'2 Самуила' 			=> '10',
					'2&nbsp;Самуила' 		=> '10',
					
					'3 Цар' 				=> '11',
					'3&nbsp;Цар' 			=> '11',
					'3Цар' 					=> '11',
					'3Цр' 					=> '11',
					'3Ц' 					=> '11',
					'3 Царств' 				=> '11',
					'3&nbsp;Царств' 		=> '11',
					'3Царств' 				=> '11',
					'1 Царей' 				=> '11',
					'1&nbsp;Царей' 			=> '11',
					'1Царей' 				=> '11',
					
					'4 Цар' 				=> '12',
					'4&nbsp;Цар' 			=> '12',
					'4Цар' 					=> '12',
					'4Цр' 					=> '12',
					'4Ц' 					=> '12',
					'4 Царств' 				=> '12',
					'4&nbsp;Царств' 		=> '12',
					'4Царств' 				=> '12',
					'2 Царей' 				=> '12',
					'2&nbsp;Царей' 			=> '12',
					'2Царей' 				=> '12',
					
					'1 Пар' 				=> '13',
					'1&nbsp;Пар' 			=> '13',
					'1Пар' 					=> '13',
					'1Пр' 					=> '13',
					'1 Паралипоменон' 		=> '13',
					'1&nbsp;Паралипоменон' 	=> '13',
					'1Паралипоменон' 		=> '13',
					'1 Хрон' 				=> '13',
					'1&nbsp;Хрон' 			=> '13',
					'1Хрон' 				=> '13',
					'1Хр' 					=> '13',
					'1 Хроник' 				=> '13',
					'1&nbsp;Хроник' 		=> '13',
					'1Хроник' 				=> '13',
					
					'2 Пар' 				=> '14',
					'2&nbsp;Пар' 			=> '14',
					'2Пар' 					=> '14',
					'2 Паралипоменон' 		=> '14',
					'2&nbsp;Паралипоменон' 	=> '14',
					'2Паралипоменон' 		=> '14',
					'2 Хрон' 				=> '14',
					'2&nbsp;Хрон' 			=> '14',
					'2Хрон' 				=> '14',
					'2Хр' 					=> '14',
					'2 Хроник' 				=> '14',
					'2&nbsp;Хроник' 		=> '14',
					'2Хроник' 				=> '14',
					
					'Ездр' 					=> '15',
					'Ез' 					=> '15',
					'Езд' 					=> '15',
					'Ездра' 				=> '15',
					'Ездры' 				=> '15',
					
					'Неем' 					=> '16',
					'Нм' 					=> '16',
					'Неемия' 				=> '16',
					'Неемии' 				=> '16',
					
					'Есф' 					=> '17',
					'Ес' 					=> '17',
					'Есфирь' 				=> '17',
					'Есфири' 				=> '17',
					
					'Иов' 					=> '18',
					'Ив' 					=> '18',
					'Иова' 					=> '18',
					
					'Пс' 					=> '19',
					'Псал' 					=> '19',
					'Псл' 					=> '19',
					'Псалт' 				=> '19',
					'Псалмы' 				=> '19',
					'Псалтирь'				=> '19',
					'Псалтырь' 				=> '19',
					'Псалом' 				=> '19',
					
					'Пр' 					=> '20',
					'Прит' 					=> '20',
					'Притч' 				=> '20',
					'Притчи' 				=> '20',
					'Притча' 				=> '20',
					
					'Екк' 					=> '21',
					'Экк' 					=> '21',
					'Ек' 					=> '21',
					'Эк' 					=> '21',
					'Екл' 					=> '21',
					'Экл' 					=> '21',
					'Екк' 					=> '21',
					'Экк' 					=> '21',
					'Еккл' 					=> '21',
					'Эккл' 					=> '21',
					'Екклесиаст' 			=> '21',
					'Екклезиаст' 			=> '21',
					'Экклесиаст' 			=> '21',
					'Экклезиаст' 			=> '21',
					'Екклесиаста' 			=> '21',
					'Екклезиаста' 			=> '21',
					'Экклесиаста' 			=> '21',
					'Экклезиаста' 			=> '21',
					
					'Песн' 					=> '22',
					'Пес' 					=> '22',
					'Псн' 					=> '22',
					'Песни' 				=> '22',
					'Песнь Песней' 			=> '22',
					'Песнь' 				=> '22',
					'Песн.Песней' 			=> '22',
					'Песн. Песней' 			=> '22',
					
					'Ис' 					=> '23',
					'Иса' 					=> '23',
					'Исайя' 				=> '23',
					'Исаия' 				=> '23',
					'Исайи' 				=> '23',
					'Исаии' 				=> '23',
					
					'Иер' 					=> '24',
					'Ир' 					=> '24',
					'Иерем' 				=> '24',
					'Иеремия' 				=> '24',
					
					'Плач' 					=> '25',
					'Пл' 					=> '25',
					'Плч' 					=> '25',
					'Пл. Иер' 				=> '25',
					'Пл.&nbsp;Иер' 			=> '25',
					'Пл.Иер' 				=> '25',
					'Иеремии' 				=> '25',
					
					'Из' 					=> '26',
					'Иез' 					=> '26',
					'Иезек' 				=> '26',
					'Иезекииль' 			=> '26',
					'Иезекииля' 			=> '26',
					
					'Дн' 					=> '27',
					'Дан' 					=> '27',
					'Днл' 					=> '27',
					'Даниил' 				=> '27',
					'Даниила' 				=> '27',
					
					'Ос' 					=> '28',
					'Осия' 					=> '28',
					'Осии' 					=> '28',
					
					'Иоил' 					=> '29',
					'Ил' 					=> '29',
					'Иоиль' 				=> '29',
					'Иоиля' 				=> '29',
					
					'Ам' 					=> '30',
					'Амс' 					=> '30',
					'Амос' 					=> '30',
					'Амоса' 				=> '30',
					
					'Иона' 					=> '32',
					'Ионы' 					=> '32',
					'Ион' 					=> '32',
					
					'Мх' 					=> '33',
					'Мих' 					=> '33',
					'Михей' 				=> '33',
					'Михея' 				=> '33',
					
					'Наум' 					=> '34',
					'Наума' 				=> '34',
					
					'Ав' 					=> '35',
					'Авв' 					=> '35',
					'Аввак' 				=> '35',
					'Аввакум' 				=> '35',
					'Аввакума' 				=> '35',
					
					'Соф' 					=> '36',
					'Сф' 					=> '36',
					'Софон' 				=> '36',
					'Софония' 				=> '36',
					'Софонии' 				=> '36',
					
					'Аг' 					=> '37',
					'Агг' 					=> '37',
					'Аггей' 				=> '37',
					'Аггея' 				=> '37',
					
					'Зах' 					=> '38',
					'Зхр' 					=> '38',
					'Захар' 				=> '38',
					'Захария' 				=> '38',
					'Захарии' 				=> '38',
					
					'Мал' 					=> '39',
					'Мл' 					=> '39',
					'Млх' 					=> '39',
					'Малах' 				=> '39',
					'Малахия' 				=> '39',
					'Малахии' 				=> '39',
					
					'Мф' 					=> '40',
					'Мат' 					=> '40',
					'Мтф' 					=> '40',
					'Мт' 					=> '40',
					'Матф' 					=> '40',
					'Матфея' 				=> '40',
					'Матфей' 				=> '40',
					
					'Мк' 					=> '41',
					'Мар' 					=> '41',
					'Мр' 					=> '41',
					'Мрк' 					=> '41',
					'Марк' 					=> '41',
					'Марка' 				=> '41',
					
					'Лк' 					=> '42',
					'Лук' 					=> '42',
					'Лука' 					=> '42',
					'Луки' 					=> '42',
					
					'Ин' 					=> '43',
					'Иоан' 					=> '43',
					'Иоанн' 				=> '43',
					'Иоанна' 				=> '43',
					
					'Деян' 					=> '44',
					'Дея' 					=> '44',
					'Д.А' 					=> '44',
					'Деяния' 				=> '44',
					
					'Иак' 					=> '59',
					'Ик' 					=> '59',
					'Иаков' 				=> '59',
					'Иакова' 				=> '59',
					
					'1 Пет' 				=> '60',
					'1&nbsp;Пет' 			=> '60',
					'1Пет' 					=> '60',
					'1 Пт' 					=> '60',
					'1&nbsp;Пт' 			=> '60',
					'1Пт' 					=> '60',
					'1 Птр' 				=> '60',
					'1&nbsp;Птр' 			=> '60',
					'1Птр' 					=> '60',
					'1 Петр' 				=> '60',
					'1&nbsp;Петр' 			=> '60',
					'1Петр' 				=> '60',
					'1 Петра' 				=> '60',
					'1&nbsp;Петра' 			=> '60',
					'1Петра' 				=> '60',
					
					'2 Пет' 				=> '61',
					'2&nbsp;Пет' 			=> '61',
					'2Пет' 					=> '61',
					'2 Пт' 					=> '61',
					'2&nbsp;Пт' 			=> '61',
					'2Пт' 					=> '61',
					'2 Птр' 				=> '61',
					'2&nbsp;Птр' 			=> '61',
					'2Птр' 					=> '61',
					'2 Петр' 				=> '61',
					'2&nbsp;Петр' 			=> '61',
					'2Петр' 				=> '61',
					'2 Петра' 				=> '61',
					'2&nbsp;Петра' 			=> '61',
					'2Петра' 				=> '61',
					
					'1 Ин' 					=> '62',
					'1&nbsp;Ин' 			=> '62',
					'1Ин' 					=> '62',
					'1 Иоан' 				=> '62',
					'1&nbsp;Иоан' 			=> '62',
					'1Иоан' 				=> '62',
					'1 Иоанн' 				=> '62',
					'1&nbsp;Иоанн' 			=> '62',
					'1Иоанн' 				=> '62',
					'1 Иоанна' 				=> '62',
					'1&nbsp;Иоанна' 		=> '62',
					'1Иоанна' 				=> '62',
					
					'Рим' 					=> '45',
					'Римл' 					=> '45',
					'Римлянам' 				=> '45',
					
					'1 Кор' 				=> '46',
					'1&nbsp;Кор' 			=> '46',
					'1Кор' 					=> '46',
					'1 Коринф' 				=> '46',
					'1&nbsp;Коринф' 		=> '46',
					'1Коринф' 				=> '46',
					'1 Коринфянам' 			=> '46',
					'1&nbsp;Коринфянам' 	=> '46',
					'1Коринфянам' 			=> '46',
					
					'2 Кор' 				=> '47',
					'2&nbsp;Кор' 			=> '47',
					'2Кор' 					=> '47',
					'2 Коринф' 				=> '47',
					'2&nbsp;Коринф' 		=> '47',
					'2Коринф' 				=> '47',
					'2 Коринфянам' 			=> '47',
					'2&nbsp;Коринфянам' 	=> '47',
					'2Коринфянам' 			=> '47',
					
					'Гал' 					=> '48',
					'Галат' 				=> '48',
					'Галатам' 				=> '48',
					
					'Еф' 					=> '49',
					'Эф' 					=> '49',
					'Ефес' 					=> '49',
					'Эфес' 					=> '49',
					'Ефесянам' 				=> '49',
					'Эфесянам' 				=> '49',
					
					'Флп' 					=> '50',
					'Фил' 					=> '50',
					'Филип' 				=> '50',
					'Филиппийцам' 			=> '50',
                    
					'Кол' 					=> '51',
					'Кл' 					=> '51',
					'Колос' 				=> '51',
					'Колоссянам' 			=> '51',
					
					'1 Фес' 				=> '52',
					'1&nbsp;Фес' 			=> '52',
					'1Фес' 					=> '52',
					'1 Фесс' 				=> '52',
					'1&nbsp;Фесс' 			=> '52',
					'1Фесс' 				=> '52',
					'1 Фессалоникийцам' 	=> '52',
					'1&nbsp;Фессалоникийцам' => '52',
					'1Фессалоникийцам' 		=> '52',
					
					
					'2 Фес' 				=> '53',
					'2&nbsp;Фес' 			=> '53',
					'2Фес' 					=> '53',
					'2 Фесс' 				=> '53',
					'2&nbsp;Фесс' 			=> '53',
					'2Фесс' 				=> '53',
					'2 Фессалоникийцам' 	=> '53',
					'2&nbsp;Фессалоникийцам' => '53',
					'2Фессалоникийцам' 		=> '53',
					
					'1 Тим' 				=> '54',
					'1&nbsp;Тим' 			=> '54',
					'1Тим' 					=> '54',
					'1 Тимоф' 				=> '54',
					'1&nbsp;Тимоф' 			=> '54',
					'1Тимоф' 				=> '54',
					'1 Тимофею' 			=> '54',
					'1&nbsp;Тимофею' 		=> '54',
					'1Тимофею' 				=> '54',
					'1 Тимофея' 			=> '54',
					'1&nbsp;Тимофея' 		=> '54',
					'1Тимофея' 				=> '54',
					
					'2 Тим' 				=> '55',
					'2&nbsp;Тим' 			=> '55',
					'2Тим' 					=> '55',
					'2 Тимоф' 				=> '55',
					'2&nbsp;Тимоф' 			=> '55',
					'2Тимоф' 				=> '55',
					'2 Тимофею' 			=> '55',
					'2&nbsp;Тимофею' 		=> '55',
					'2Тимофею' 				=> '55',
					'2 Тимофея' 			=> '55',
					'2&nbsp;Тимофея' 		=> '55',
					'2Тимофея' 				=> '55',
					
					'Тит' 					=> '56',
					'Титу' 					=> '56',
					
					'Евр' 					=> '58',
					'Евреям' 				=> '58',
					
					'Откр' 					=> '66',
					'Отк' 					=> '66',
					'Откровен' 				=> '66',
					'Откровение' 			=> '66',
					'Апокалипс'				=> '66',
					'Апокалипсис'			=> '66',
					
					'Ав' 					=> '31',
					'Авд' 					=> '31',
					'Адвий' 				=> '31',
					'Адвия' 				=> '31',
					
					'Флм' 					=> '57',
					'Филим' 				=> '57',
					'Филимон' 				=> '57',
					'Филимону' 				=> '57',
					
					'2 Ин' 					=> '63',
					'2&nbsp;Ин' 			=> '63',
					'2Ин' 					=> '63',
					'2 Иоан' 				=> '63',
					'2&nbsp;Иоан' 			=> '63',
					'2Иоан' 				=> '63',
					'2 Иоанн' 				=> '63',
					'2&nbsp;Иоанн' 			=> '63',
					'2Иоанн' 				=> '63',
					'2 Иоанна' 				=> '63',
					'2&nbsp;Иоанна' 		=> '63',
					'2Иоанна' 				=> '63',
					
					'3 Ин' 					=> '64',
					'3&nbsp;Ин' 			=> '64',
					'3Ин' 					=> '64',
					'3 Иоан' 				=> '64',
					'3&nbsp;Иоан' 			=> '64',
					'3Иоан' 				=> '64',
					'3 Иоанн' 				=> '64',
					'3&nbsp;Иоанн' 			=> '64',
					'3Иоанн' 				=> '64',
					'3 Иоанна' 				=> '64',
					'3&nbsp;Иоанна' 		=> '64',
					'3Иоанна' 				=> '64',
					
					'Иуд' 					=> '65',
					'Ид' 					=> '65',
					'Иуда' 					=> '65',
					'Иуды' 					=> '65',
					);
	
		$BookByNameRoman = array(
					'I Цар' 				=> '9',
					'I&nbsp;Цар' 			=> '9',
					'IЦар' 					=> '9',
					'IЦр'					=> '9',
					'IЦ'					=> '9',
					'I Царств' 				=> '9',
					'I&nbsp;Царств' 		=> '9',
					'IЦарств' 				=> '9',
					'I Сам' 				=> '9',
					'I&nbsp;Сам' 			=> '9',
					'IСам' 					=> '9',
					'I Самуила' 			=> '9',
					'I&nbsp;Самуила' 		=> '9',
					
					'II Цар' 				=> '10',
					'II&nbsp;Цар' 			=> '10',
					'IIЦар' 				=> '10',
					'IIЦр' 					=> '10',
					'IIЦ' 					=> '10',
					'II Царств' 			=> '10',
					'II&nbsp;Царств' 		=> '10',
					'IIЦарств' 				=> '10',
					'II Сам' 				=> '10',
					'II&nbsp;Сам' 			=> '10',
					'IIСам' 				=> '10',
					'II Самуила' 			=> '10',
					'II&nbsp;Самуила' 		=> '10',
					
					'III Цар' 				=> '11',
					'III&nbsp;Цар' 			=> '11',
					'IIIЦар' 				=> '11',
					'IIIЦр' 				=> '11',
					'IIIЦ' 					=> '11',
					'III Царств' 			=> '11',
					'III&nbsp;Царств' 		=> '11',
					'IIIЦарств' 			=> '11',
					'I Царей' 				=> '11',
					'I&nbsp;Царей' 			=> '11',
					'IЦарей' 				=> '11',
					
					'IV Цар' 				=> '12',
					'IV&nbsp;Цар' 			=> '12',
					'IVЦар' 				=> '12',
					'IVЦр' 					=> '12',
					'IVЦ' 					=> '12',
					'IV Царств' 			=> '12',
					'IV&nbsp;Царств' 		=> '12',
					'IVЦарств' 				=> '12',
					'II Царей' 				=> '12',
					'II&nbsp;Царей' 		=> '12',
					'IIЦарей' 				=> '12',
					
					'I Пар' 				=> '13',
					'I&nbsp;Пар' 			=> '13',
					'IПар' 					=> '13',
					'IПр' 					=> '13',
					'I Паралипоменон' 		=> '13',
					'I&nbsp;Паралипоменон' 	=> '13',
					'IПаралипоменон' 		=> '13',
					'I Хрон' 				=> '13',
					'I&nbsp;Хрон' 			=> '13',
					'IХрон' 				=> '13',
					'IХр' 					=> '13',
					'I Хроник' 				=> '13',
					
					'II Пар' 				=> '14',
					'II&nbsp;Пар' 			=> '14',
					'IIПар' 				=> '14',
					'II Паралипоменон' 		=> '14',
					'II&nbsp;Паралипоменон' => '14',
					'IIПаралипоменон' 		=> '14',
					'II Хрон' 				=> '14',
					'II&nbsp;Хрон' 			=> '14',
					'IIХрон' 				=> '14',
					'IIХр' 					=> '14',
					'II Хроник' 			=> '14',
					
					'I Пет' 				=> '60',
					'I&nbsp;Пет' 			=> '60',
					'IПет' 					=> '60',
					'I Пт' 					=> '60',
					'I&nbsp;Пт' 			=> '60',
					'IПт' 					=> '60',
					'I Птр' 				=> '60',
					'I&nbsp;Птр' 			=> '60',
					'IПтр' 					=> '60',
					'I Петр' 				=> '60',
					'I&nbsp;Петр' 			=> '60',
					'IПетр' 				=> '60',
					'I Петра' 				=> '60',
					'I&nbsp;Петра' 			=> '60',
					'IПетра' 				=> '60',
					
					'II Пет' 				=> '61',
					'II&nbsp;Пет' 			=> '61',
					'IIПет' 				=> '61',
					'II Пт' 				=> '61',
					'II&nbsp;Пт' 			=> '61',
					'IIПт' 					=> '61',
					'II Птр' 				=> '61',
					'II&nbsp;Птр' 			=> '61',
					'IIПтр' 				=> '61',
					'II Петр' 				=> '61',
					'II&nbsp;Петр' 			=> '61',
					'IIПетр' 				=> '61',
					'II Петра' 				=> '61',
					'II&nbsp;Петра' 		=> '61',
					'IIПетра' 				=> '61',
					
					'I Ин' 					=> '62',
					'I&nbsp;Ин' 			=> '62',
					'IИн' 					=> '62',
					'I Иоан' 				=> '62',
					'I&nbsp;Иоан' 			=> '62',
					'IИоан' 				=> '62',
					'I Иоанн' 				=> '62',
					'I&nbsp;Иоанн' 			=> '62',
					'IИоанн' 				=> '62',
					'I Иоанна' 				=> '62',
					'I&nbsp;Иоанна' 		=> '62',
					'IИоанна' 				=> '62',
					
					'I Кор' 				=> '46',
					'I&nbsp;Кор' 			=> '46',
					'IКор' 					=> '46',
					'I Коринф' 				=> '46',
					'I&nbsp;Коринф' 		=> '46',
					'IКоринф' 				=> '46',
					'I Коринфянам' 			=> '46',
					'I&nbsp;Коринфянам' 	=> '46',
					'IКоринфянам' 			=> '46',
					
					'II Кор' 				=> '47',
					'II&nbsp;Кор' 			=> '47',
					'IIКор' 				=> '47',
					'II Коринф' 			=> '47',
					'II&nbsp;Коринф' 		=> '47',
					'IIКоринф' 				=> '47',
					'II Коринфянам' 		=> '47',
					'II&nbsp;Коринфянам' 	=> '47',
					'IIКоринфянам' 			=> '47',
					
					'I Фес' 				=> '52',
					'I&nbsp;Фес' 			=> '52',
					'IФес' 					=> '52',
					'I Фесс' 				=> '52',
					'I&nbsp;Фесс' 			=> '52',
					'IФесс' 				=> '52',
					'I Фессалоникийцам' 	=> '52',
					'I&nbsp;Фессалоникийцам' => '52',
					'IФессалоникийцам' 		=> '52',
					
					'II Фес' 				=> '53',
					'II&nbsp;Фес' 			=> '53',
					'IIФес' 				=> '53',
					'II Фесс' 				=> '53',
					'II&nbsp;Фесс' 			=> '53',
					'IIФесс' 				=> '53',
					'II Фессалоникийцам' 	=> '53',
					'II&nbsp;Фессалоникийцам' => '53',
					'IIФессалоникийцам' 	=> '53',
					
					'I Тим' 				=> '54',
					'I&nbsp;Тим' 			=> '54',
					'IТим' 					=> '54',
					'I Тимоф' 				=> '54',
					'I&nbsp;Тимоф' 			=> '54',
					'IТимоф' 				=> '54',
					'I Тимофею' 			=> '54',
					'I&nbsp;Тимофею' 		=> '54',
					'IТимофею' 				=> '54',
					'I Тимофея' 			=> '54',
					'I&nbsp;Тимофея' 		=> '54',
					'IТимофея' 				=> '54',
					
					'II Тим' 				=> '55',
					'II&nbsp;Тим' 			=> '55',
					'IIТим' 				=> '55',
					'II Тимоф' 				=> '55',
					'II&nbsp;Тимоф' 		=> '55',
					'IIТимоф' 				=> '55',
					'II Тимофею' 			=> '55',
					'II&nbsp;Тимофею' 		=> '55',
					'IIТимофею' 			=> '55',
					'II Тимофея' 			=> '55',
					'II&nbsp;Тимофея' 		=> '55',
					'IIТимофея' 			=> '55',
					
					'II Ин' 				=> '63',
					'II&nbsp;Ин' 			=> '63',
					'IIИн' 					=> '63',
					'II Иоан' 				=> '63',
					'II&nbsp;Иоан' 			=> '63',
					'IIИоан' 				=> '63',
					'II Иоанн' 				=> '63',
					'II&nbsp;Иоанн' 		=> '63',
					'IIИоанн' 				=> '63',
					'II Иоанна' 			=> '63',
					'II&nbsp;Иоанна' 		=> '63',
					'IIИоанна' 				=> '63',
					
					'III Ин' 				=> '64',
					'III&nbsp;Ин' 			=> '64',
					'IIIИн' 				=> '64',
					'III Иоан' 				=> '64',
					'III&nbsp;Иоан' 		=> '64',
					'IIIИоан' 				=> '64',
					'III Иоанн' 			=> '64',
					'III&nbsp;Иоанн' 		=> '64',
					'IIIИоанн' 				=> '64',
					'III Иоанна' 			=> '64',
					'III&nbsp;Иоанна' 		=> '64',
					'IIIИоанна' 			=> '64',
					);
	}
					
	switch ($type) {
		case full:
			$BookByNameOut = $BookByNameFull;
			break;
		case short:
			if ($isRoman) {
				$BookByNameOut = $BookByNameShort + $BookByNameRoman;
			} else {
				$BookByNameOut = $BookByNameShort;
			}
			break;
		case all:
			if ($isRoman) {
				$BookByNameOut = $BookByNameFull + $BookByNameShort + $BookByNameRoman;
			} else {
				$BookByNameOut = $BookByNameFull + $BookByNameShort;
			}
			break;
		default:
			$BookByNameOut = $BookByNameFull + $BookByNameShort;
			break;
	}
		
	foreach($BookByNameOut as $bookName => $bookIndex) {
		$BookByNameOut[$bookName . "."] = $bookIndex;
		//$BookByNameOut[$bookName . "&nbsp;"] = $bookIndex; 
		//$BookByNameOut[$bookName . ".&nbsp;"] = $bookIndex;
	}
	
	return $BookByNameOut;
}

// Исправление названий книг по стандарту (отдельно полных и кратких)
function RightBibleBooks($name) {

	global $languageOut;

	if ($languageOut == 'ua') {
		$BookByNameFullRight = array(
					'1' => 'Буття',
					'2' => 'Вихід',
					'3' => 'Левіт',
					'4' => 'Числа',
					'5' => 'Второзаконня',
					'6' => 'Книга Ісуса Навина',
					'7' => 'Книга суддів ізраїльських',
					'8' => 'Книга Рути',
					'9' => 'Перша книга Самуїла',
					'10' => 'Друга книга Самуїла',
					'11' => 'Перша книга царів',
					'12' => 'Друга книга царів',
					'13' => 'Перша книга хронік',
					'14' => 'Друга книга хронік',
					'15' => 'Книга Езри',
					'16' => 'Книга Неємії',
					'17' => 'Книга Естери',
					'18' => 'Книга Йова',
					'19' => 'Книга Псалмів',
					'20' => 'Книга приповідок Соломона',
					'21' => 'Книга Екклесиаста',
					'22' => 'Книга пісні пісень Соломона',
					'23' => 'Книга пророка Ісаї',
					'24' => 'Книга пророка Єремії',
					'25' => 'Книга плач Єремії',
					'26' => 'Книга пророка Єзекиїла',
					'27' => 'Книга пророка Даниїла',
					'28' => 'Книга пророка Осії',
					'29' => 'Книга пророка Йоіла',
					'30' => 'Книга пророка Амоса',
					'31' => 'Книга пророка Авдія',
					'32' => 'Книга пророка Йони',
					'33' => 'Книга пророка Міхея',
					'34' => 'Книга пророка Наума',
					'35' => 'Книга пророка Авакума',
					'36' => 'Книга пророка Софонії',
					'37' => 'Книга пророка Аггея',
					'38' => 'Книга пророка Захарії',
					'39' => 'Книга пророка Малахії',
					'40' => 'Євангеліє від Матея',
					'41' => 'Євангеліє від Марка',
					'42' => 'Євангеліє від Луки',
					'43' => 'Євангеліє від Івана',
					'44' => 'Дії апостолів',
					'59' => 'Послання Якова',
					'60' => 'Перше послання Петра',
					'61' => 'Друге послання Петра',
					'62' => 'Перше послання Івана',
					'63' => 'Друге послання Івана',
                    '64' => 'Третє послання Івана',
					'65' => 'Послання Юди',
					'45' => 'Послання до римлян',
					'46' => 'Перше послання до коринтян',
					'47' => 'Друге послання до коринтян',
					'48' => 'Послання до галатів',
					'49' => 'Послання до ефесян',
					'50' => 'Послання до филип’ян',
					'51' => 'Послання до колосян',
					'52' => 'Перше послання до солунян',
					'53' => 'Друге послання до солунян',
					'54' => 'Перше послання до Тимотея',
					'55' => 'Друге послання до Тимотея',
					'56' => 'Послання до Тита',
					'57' => 'Послання до Филимона',
					'58' => 'Послання до євреїв',
					'66' => 'Об’явлення Івана Богослова',
					);

		$BookByNameShortRight = array(
					'1' => 'Бут.',
					'2' => 'Вих.',
					'3' => 'Лев.',
					'4' => 'Чис.',
					'5' => 'Втор.',
					'6' => 'Нав.',
					'7' => 'Суд.',
					'8' => 'Рут.',
					'9' => '1 Сам.',
					'10' => '2 Сам.',
					'11' => '1 Цар.',
					'12' => '2 Цар.',
					'13' => '1 Хр.',
					'14' => '2 Хр.',
					'15' => 'Ез.',
					'16' => 'Неєм.',
					'17' => 'Ест.',
					'18' => 'Йов',
					'19' => 'Пс.',
					'20' => 'Пр.',
					'21' => 'Екл.',
					'22' => 'Пісн.',
					'23' => 'Іс.',
					'24' => 'Єр.',
					'25' => 'Плач',
					'26' => 'Єз.',
					'27' => 'Дан.',
					'28' => 'Ос.',
					'29' => 'Йоіл',
					'30' => 'Ам.',
					'31' => 'Авд.',
					'32' => 'Йон.',
					'33' => 'Міх.',
					'34' => 'Наум',
					'35' => 'Ав.',
					'36' => 'Соф.',
					'37' => 'Аг.',
					'38' => 'Зах.',
					'39' => 'Мал.',
					'40' => 'Мт.',
					'41' => 'Мр.',
					'42' => 'Лк.',
					'43' => 'Ів.',
					'44' => 'Дії',
					'59' => 'Як.',
					'60' => '1 Пт.',
					'61' => '2 Пт.',
					'62' => '1 Ів.',
					'63' => '2 Ів.',
                    '64' => '3 Ів.',
					'65' => 'Юд.',
					'45' => 'Рим.',
					'46' => '1 Кор.',
					'47' => '2 Кор.',
					'48' => 'Гал.',
					'49' => 'Еф.',
					'50' => 'Флп.',
					'51' => 'Кол.',
					'52' => '1 Сол.',
					'53' => '2 Сол.',
					'54' => '1 Тим.',
					'55' => '2 Тим.',
					'56' => 'Тит.',
					'57' => 'Флм.',
					'58' => 'Євр.',
					'66' => 'Об.',
					);
	} else {
		$BookByNameFullRight = array(
					'1' => 'Бытие',
					'2' => 'Исход',
					'3' => 'Левит',
					'4' => 'Числа',
					'5' => 'Второзаконие',
					'6' => 'Книга Иисуса Навина',
					'7' => 'Книга судей израилевых',
					'8' => 'Книга Руфи',
					'9' => 'Первая книга царств',
					'10' => 'Вторая книга царств',
					'11' => 'Третья книга царств',
					'12' => 'Четвертая книга царств',
					'13' => 'Первая книга Паралипоменон',
					'14' => 'Вторая книга Паралипоменон',
					'15' => 'Книга Ездры',
					'16' => 'Книга Неемии',
					'17' => 'Книга Есфири',
					'18' => 'Книга Иова',
					'19' => 'Псалтирь',
					'20' => 'Книга притчей соломоновых',
					'21' => 'Книга Екклесиаста',
					'22' => 'Книга песни песней Соломона',
					'23' => 'Книга пророка Исайи',
					'24' => 'Книга пророка Иеремии',
					'25' => 'Книга Плач Иеремии',
					'26' => 'Книга пророка Иезекииля',
					'27' => 'Книга пророка Даниила',
					'28' => 'Книга пророка Осии',
					'29' => 'Книга пророка Иоиля',
					'30' => 'Книга пророка Амоса',
					'31' => 'Книга пророка Авдия',
					'32' => 'Книга пророка Ионы',
					'33' => 'Книга пророка Михея',
					'34' => 'Книга пророка Наума',
					'35' => 'Книга пророка Аввакума',
					'36' => 'Книга пророка Софонии',
					'37' => 'Книга пророка Аггея',
					'38' => 'Книга пророка Захарии',
					'39' => 'Книга пророка Малахии',
					'40' => 'Евангелие от Матфея',
					'41' => 'Евангелие от Марка',
					'42' => 'Евангелие от Луки',
					'43' => 'Евангелие от Иоанна',
					'44' => 'Деяния апостолов',
					'59' => 'Послание Иакова',
					'60' => 'Первое послание Петра',
					'61' => 'Второе послание Петра',
					'62' => 'Первое послание Иоанна',
					'63' => 'Второе послание Иоанна',
                    '64' => 'Третье послание Иоанна',
					'65' => 'Послание Иуды',
					'45' => 'Послание к римлянам',
					'46' => 'Первое послание к коринфянам',
					'47' => 'Второе послание к коринфянам',
					'48' => 'Послание к галатам',
					'49' => 'Послание к ефесянам',
					'50' => 'Послание к филиппийцам',
					'51' => 'Послание к колоссянам',
					'52' => 'Первое послание к фессалоникийцам',
					'53' => 'Второе послание к фессалоникийцам',
					'54' => 'Первое послание к Тимофею',
					'55' => 'Второе послание к Тимофею',
					'56' => 'Послание к Титу',
					'57' => 'Послание к Филимону',
					'58' => 'Послание к евреям',
					'66' => 'Откровение Иоанна Богослова',
					);

		$BookByNameShortRight = array(
					'1' => 'Быт.',
					'2' => 'Исх.',
					'3' => 'Лев.',
					'4' => 'Числ.',
					'5' => 'Втор.',
					'6' => 'Нав.',
					'7' => 'Суд.',
					'8' => 'Руфь',
					'9' => '1 Цар.',
					'10' => '2 Цар.',
					'11' => '3 Цар.',
					'12' => '4 Цар.',
					'13' => '1 Пар.',
					'14' => '2 Пар.',
					'15' => 'Езд.',
					'16' => 'Неем.',
					'17' => 'Есф.',
					'18' => 'Иов',
					'19' => 'Пс.',
					'20' => 'Пр.',
					'21' => 'Еккл.',
					'22' => 'Песн.',
					'23' => 'Ис.',
					'24' => 'Иер.',
					'25' => 'Плач',
					'26' => 'Иез.',
					'27' => 'Дан.',
					'28' => 'Ос.',
					'29' => 'Иоиль',
					'30' => 'Ам.',
					'31' => 'Авд.',
					'32' => 'Иона',
					'33' => 'Мих.',
					'34' => 'Наум',
					'35' => 'Авв.',
					'36' => 'Соф.',
					'37' => 'Агг.',
					'38' => 'Зах.',
					'39' => 'Мал.',
					'40' => 'Мф.',
					'41' => 'Мк.',
					'42' => 'Лк.',
					'43' => 'Ин.',
					'44' => 'Деян.',
					'59' => 'Иак.',
					'60' => '1 Петр.',
					'61' => '2 Петр.',
					'62' => '1 Ин.',
					'63' => '2 Ин.',
                    '64' => '3 Ин.',
					'65' => 'Иуд.',
					'45' => 'Рим.',
					'46' => '1 Кор.',
					'47' => '2 Кор.',
					'48' => 'Гал.',
					'49' => 'Еф.',
					'50' => 'Флп.',
					'51' => 'Кол.',
					'52' => '1 Фес.',
					'53' => '2 Фес.',
					'54' => '1 Тим.',
					'55' => '2 Тим.',
					'56' => 'Тит.',
					'57' => 'Флм.',
					'58' => 'Евр.',
					'66' => 'Откр.',
					);
	}
	
	$booksFull = GetBibleBooks($type = 'full');
	$booksShort = GetBibleBooks($type = 'short');
	
	if ($bookIndex = $booksFull[$name]) {
		$name = $BookByNameFullRight[$bookIndex];
	} elseif ($bookIndex = $booksShort[$name]) {
		$name = $BookByNameShortRight[$bookIndex];
	}
	
	$name = str_replace(" ", "&nbsp;", $name);
	
	return $name;
}

// Споставление номера книги с ее индексом для allbible.info
function BibleIndexes($name, $source) {

	$IndexAllBible = array(
					'1' => 'ge',
					'2' => 'ex',
					'3' => 'le',
					'4' => 'nu',
					'5' => 'de',
					'6' => 'jos',
					'7' => 'jud',
					'8' => 'ru',
					'9' => '1ki',
					'10' => '2ki',
					'11' => '3ki',
					'12' => '4ki',
					'13' => '1ch',
					'14' => '2ch',
					'15' => 'ezr',
					'16' => 'ne',
					'17' => 'es',
					'18' => 'job',
					'19' => 'ps',
					'20' => 'pr',
					'21' => 'ec',
					'22' => 'so',
					'23' => 'isa',
					'24' => 'jer',
					'25' => 'la',
					'26' => 'eze',
					'27' => 'da',
					'28' => 'ho',
					'29' => 'joe',
					'30' => 'am',
					'31' => 'ob',
					'32' => 'jon',
					'33' => 'mic',
					'34' => 'na',
					'35' => 'hab',
					'36' => 'sof',
					'37' => 'hag',
					'38' => 'zec',
					'39' => 'mal',
					'40' => 'mt',
					'41' => 'mr',
					'42' => 'lu',
					'43' => 'joh',
					'44' => 'ac',
					'59' => 'jas',
					'60' => '1pe',
					'61' => '2pe',
					'62' => '1jo',
					'63' => '2jo',
                    '64' => '3jo',
					'65' => 'jude',
					'45' => 'ro',
					'46' => '1co',
					'47' => '2co',
					'48' => 'ga',
					'49' => 'eph',
					'50' => 'php',
					'51' => 'col',
					'52' => '1th',
					'53' => '2th',
					'54' => '1ti',
					'55' => '2ti',
					'56' => 'tit',
					'57' => 'phm',
					'58' => 'heb',
					'66' => 're',
					);

	$IndexBibleZoom = array(
					'1' => '-1',
					'2' => '-2',
					'3' => '-3',
					'4' => '-4',
					'5' => '-5',
					'6' => '-6',
					'7' => '-7',
					'8' => '-8',
					'9' => '-9',
					'10' => '-10',
					'11' => '-11',
					'12' => '-12',
					'13' => '-13',
					'14' => '-14',
					'15' => '-15',
					'16' => '-16',
					'17' => '-17',
					'18' => '-18',
					'19' => '-19',
					'20' => '-20',
					'21' => '-21',
					'22' => '-22',
					'23' => '-23',
					'24' => '-24',
					'25' => '-25',
					'26' => '-26',
					'27' => '-27',
					'28' => '-28',
					'29' => '-29',
					'30' => '-30',
					'31' => '-31',
					'32' => '-32',
					'33' => '-33',
					'34' => '-34',
					'35' => '-35',
					'36' => '-36',
					'37' => '-37',
					'38' => '-38',
					'39' => '-39',
					'40' => '1',
					'41' => '2',
					'42' => '3',
					'43' => '4',
					'44' => '5',
					'59' => '6',
					'60' => '7',
					'61' => '8',
					'62' => '9',
					'63' => '10',
                    '64' => '11',
					'65' => '12',
					'45' => '13',
					'46' => '14',
					'47' => '15',
					'48' => '16',
					'49' => '17',
					'50' => '18',
					'51' => '19',
					'52' => '20',
					'53' => '21',
					'54' => '22',
					'55' => '23',
					'56' => '24',
					'57' => '25',
					'58' => '26',
					'66' => '27',
					);
					
	$IndexBibleOnline = array(
					'1' => '1',
					'2' => '2',
					'3' => '3',
					'4' => '4',
					'5' => '5',
					'6' => '6',
					'7' => '7',
					'8' => '8',
					'9' => '9',
					'10' => '10',
					'11' => '11',
					'12' => '12',
					'13' => '13',
					'14' => '14',
					'15' => '15',
					'16' => '16',
					'17' => '17',
					'18' => '18',
					'19' => '19',
					'20' => '20',
					'21' => '21',
					'22' => '22',
					'23' => '23',
					'24' => '24',
					'25' => '25',
					'26' => '26',
					'27' => '27',
					'28' => '28',
					'29' => '29',
					'30' => '30',
					'31' => '31',
					'32' => '32',
					'33' => '33',
					'34' => '34',
					'35' => '35',
					'36' => '36',
					'37' => '37',
					'38' => '38',
					'39' => '39',
					'40' => '40',
					'41' => '41',
					'42' => '42',
					'43' => '43',
					'44' => '44',
					'59' => '45',
					'60' => '46',
					'61' => '47',
					'62' => '48',
					'63' => '49',
                    '64' => '50',
					'65' => '51',
					'45' => '52',
					'46' => '53',
					'47' => '54',
					'48' => '55',
					'49' => '56',
					'50' => '57',
					'51' => '58',
					'52' => '59',
					'53' => '60',
					'54' => '61',
					'55' => '62',
					'56' => '63',
					'57' => '64',
					'58' => '65',
					'66' => '66',
					);
					
	$IndexBibleServer = array(
					'1' => 'Бытие',
					'2' => 'Исход',
					'3' => 'Левит',
					'4' => 'Числа',
					'5' => 'Второзаконие',
					'6' => 'Книга Иисуса Навина',
					'7' => 'Книга Судей Израилевых',
					'8' => 'Книга Руфь',
					'9' => 'Первая книга Царств',
					'10' => 'Вторая книга Царств',
					'11' => 'Третья книга Царств',
					'12' => 'Четвертая книга Царств',
					'13' => 'Первая книга Паралипоменон',
					'14' => 'Вторая книга Паралипоменон',
					'15' => 'Книга Ездры',
					'16' => 'Книга Неемии',
					'17' => 'Книга Есфирь',
					'18' => 'Книга Иова',
					'19' => 'Псалтирь',
					'20' => 'Книга Притчей Соломоновых',
					'21' => 'Книга Екклесиаста',
					'22' => 'Книга Песни Песней Соломона',
					'23' => 'Книга пророка Исаии',
					'24' => 'Книга пророка Иеремии',
					'25' => 'Книга Плач Иеремии',
					'26' => 'Книга пророка Иезекииля',
					'27' => 'Книга пророка Даниила',
					'28' => 'Книга пророка Осии',
					'29' => 'Книга пророка Иоиля',
					'30' => 'Книга пророка Амоса',
					'31' => 'Книга пророка Авдия',
					'32' => 'Книга пророка Ионы',
					'33' => 'Книга пророка Михея',
					'34' => 'Книга пророка Наума',
					'35' => 'Книга пророка Аввакума',
					'36' => 'Книга пророка Софонии',
					'37' => 'Книга пророка Аггея',
					'38' => 'Книга пророка Захарии',
					'39' => 'Книга пророка Малахии',
					'40' => 'Евангелие Матфея',
					'41' => 'Евангелие Марка',
					'42' => 'Евангелие Луки',
					'43' => 'Евангелие Иоанна',
					'44' => 'Деятельность апостолов',
					'59' => 'Письмо Иакова',
					'60' => 'Первое Письмо Петра',
					'61' => 'Второе Письмо Петра',
					'62' => 'Первое Письмо Иоанна',
					'63' => 'Второе Письмо Иоанна',
                    '64' => 'Третье Письмо Иоанна',
					'65' => 'Письмо Иуды',
					'45' => 'Письмо Римлянам',
					'46' => 'Первое Письмо Коринфянам',
					'47' => 'Второе Письмо Коринфянам',
					'48' => 'Письмо Галатам',
					'49' => 'Письмо Ефесянам',
					'50' => 'Письмо Филиппийцам',
					'51' => 'Письмо Колоссянам',
					'52' => 'Первое Письмо Фессалоникийцам',
					'53' => 'Второе Письмо Фессалоникийцам',
					'54' => 'Первое Письмо Тимофею',
					'55' => 'Второе Письмо Тимофею',
					'56' => 'Письмо Титу',
					'57' => 'Письмо Филимону',
					'58' => 'Письмо Евреям',
					'66' => 'Откровение Иоанна',
					);
					
	switch ($source) {
		case 2:
			return $IndexBibleZoom[$name];
			break;
		case 3:
			return $IndexBibleOnline[$name];
			break;
		case 5:
			return $IndexBibleServer[$name];
			break;
		default:
			return $IndexAllBible[$name];
			break;
	}
}

// Ин. 1:2-4,6; 7:8

define("SingleNode", 0); 	// цифра после запятой (6)
define("EndNode", 1); 		// цифра после тире (4)
define("RootNode", 2); 		// цифра после точки с запятой (7)
define("SubNode", 3);		// цифра после двоеточия (2, 8)
define("NamedNode", 4);		// самая первая цифра после имени книги (1)

class CNode 
{
    function __construct($type = SingleNode) {$this->SetType($type); $this->SetNumber(0);}

    public function SetType($type) {$this->m_nodeType = $type;}
    public function GetType() {return $this->m_nodeType;}

    public function SetNumber($n) {$this->m_num = $n;}
    public function GetNumber() {return $this->m_num;}

    private $m_nodeType;
    private $m_num;
}

class CNodeWrapper
{
    private $m_str;
    private $m_name;


    public function __construct($name, $str) {
        $this->m_name = $name;
        $this->m_str = $str;
    }

    public function Parse() {
	    $pos = 0;
        $node = new CNode();
		$pos = $this->TrimStr($pos, ".");
        $pos = $this->TrimStr($pos);
        $node->SetType(NamedNode);
		
		if(!$this->FillNode($node, $pos)) {
			return $this->m_name + " " + $this->m_str;
        }

        $curList = array();
        $curList[] = $node;
 
        $Nodes =  array();
        $Nodes[] = $curList;
        
        $res;
        do {
            $node1= new CNode();
            $res = $this->Parse_($node1, $pos);
			
           if ($res) {
                if ($node1->GetType() == SubNode) {
                    $endList= $Nodes[count($Nodes)-1];
                    if(count($endList) > 1) {
						array_pop($Nodes);
                        $endNode = $endList[count($endList)-1];
						array_pop($endList);
						array_pop($endList);
						$endList[] = $endNode;
                        $Nodes[] = $endList;
                    }
                } else if ($node1->GetType() == EndNode || $node1->GetType() == SingleNode) {
					array_pop($curList);
                } else if ($node1->GetType() == RootNode) {
					//$curList = array($curList[0],);
					$curList = array();
				}
				$curList[] = $node1;
                $Nodes[] = $curList;
            }

        } while ($res);
        $outPut;
        if (count($Nodes) > 0 && $this->WriteStr($Nodes, $outPut, $pos)) {
            return $outPut;
        }
		return $this->m_name + " " + $this->m_str;

    }

	public function constructLink($name, &$nodeList) {
		
		global $doCorrection;
		global $source;
		global $translationAllBible;
		global $translationBibleOnline;
		global $translationBibleCenter;
		global $translationBibleServer;
		
		$books = GetBibleBooks($type = 'all');
		foreach ($books as $book => $Index) {
			if (ucwords(mb_strtolower($name, 'UTF-8')) == ucwords(mb_strtolower($book, 'UTF-8'))) {
				$bookIndex = $Index;
				$name = $book;
				break;
			}
		}
		
		if ($nodeList[0][0]->GetType() == NamedNode) {
			$txtLink = ($doCorrection) ? RightBibleBooks($name) : $name; // 
		}
		for ($i = 0; $i < count($nodeList); $i++) {
			if (!$this->getNodeText($nodeList[$i], $txtLink)) {
               return "";
            }
		}
		
		// Формируем ссылку в зависимости от сайта
		// Адрес									перевод		книга				глава	стих
		// http://allbible.info/bible/				sinodal/	phm					/1#		5
		// http://bible.com.ua/bible/r/							57					/1#		5
		// http://biblezoom.ru/#								25					-1-		5
		// http://bibleonline.ru/bible/				rus/		64					/1/#	5
		// http://bible-center.ru/bibletext/		synnew_ru/	phm					/1#		phm1_5
		// http://bibleserver.com/text/				RUS/		Послание Филимону			5
		// http://bibleserver.com/text/				RUS/		Послание Римлянам 	1.		31
		
		switch ($source) {
			case 0:
				$link = 'http://allbible.info/bible/' . $translationAllBible . BibleIndexes($bookIndex, $source);
				break;
			case 1:
				$link = 'http://bible.com.ua/bible/r/' . $bookIndex;
				break;
			case 2:
				$link = 'http://biblezoom.ru/#' . BibleIndexes($bookIndex, $source);
				break;
			case 3:
				$link = 'http://bibleonline.ru/bible/' . $translationBibleOnline . BibleIndexes($bookIndex, $source);
				break;
			case 4:
				$link = 'http://bible-center.ru/bibletext/' . $translationBibleCenter . BibleIndexes($bookIndex, $source);
				break;
			case 5:
				$link = 'http://bibleserver.com/text/' . $translationBibleServer . BibleIndexes($bookIndex, $source);
				break;
			default:
				$link = 'http://allbible.info/bible/' . $translationAllBible . BibleIndexes($bookIndex, $source);
				break;
		}
		
		$nodeArray = $nodeList[0];
		$nodeChapter = $nodeArray[count($nodeArray)-1];
		$nodeArray = $nodeList[1];
		$node = $nodeArray[count($nodeArray)-1];
		if (IsSingleChapterBook($bookIndex) && count($nodeList) == 1) { // Учитывает одноглавные книги (Флм. 6 и Флм. 1:6)
			switch ($source) {
				case 2:
					$link .= '-1-' . $nodeChapter->GetNumber();
					break;
				case 3:
					$link .= '/1/#' . $nodeChapter->GetNumber();
					break;
				case 4:
					$link .= '/1#' . BibleIndexes($bookIndex, $source) . '1_' . $nodeChapter->GetNumber();
					break;
				case 5:
					$link .= $nodeChapter->GetNumber();
					break;						
				default:
					$link .= '/1#' . $nodeChapter->GetNumber();
					break;
			}
		} elseif (IsSingleChapterBook($bookIndex) && count($nodeList) > 1 && $source == 5 && $nodeChapter->GetNumber() == 1) {
			$link .= $node->GetNumber();
		} else {
			switch ($source) {
				case 2:
					$link .= '-' . $nodeChapter->GetNumber();
					break;
				case 5:
					$link .= $nodeChapter->GetNumber();
					break;						
				default:
					$link .= '/' . $nodeChapter->GetNumber();
					break;
			}
			if (count($nodeList) > 1) {
				if ($node->GetType() != 1) { 							// Учитывает интервал глав (Иов. 38–42)
					switch ($source) {
						case 2:
							$link .= '-' . $node->GetNumber();
							break;
						case 3:
							$link .= '/#' . $node->GetNumber();
							break;
						case 4:
							$link .= '#' . BibleIndexes($bookIndex, $source) . $nodeChapter->GetNumber() . '_' . $node->GetNumber();
							break;
						case 5:
							$link .= '.' . $node->GetNumber();
							break;
						default:
							$link .= '#' . $node->GetNumber();
							break;
					}
				}
			}
		}
		
		if ($nodeList[0][0]->GetType() == RootNode) {
			return "; <a href='$link' target='blank'>" . $txtLink . "</a>";
		} else {
			return "<a href='$link' target='blank'>" . $txtLink . "</a>";
		}
	}
	
    public function WriteStr(&$nodes, &$outPut, $pos)
    {
		$linkNodes = array();
        for ($i = 0; $i < count($nodes); $i++) {
            $beg = $nodes[$i];
            $txtLink = "";
			
			// define root nodes
			$bnode = $beg[count($beg)-1];
			if( $bnode->GetType() == RootNode) {
				if (count($linkNodes)) {
					$linkstr = $this->constructLink($this->m_name, $linkNodes);
					$outPut = $outPut . $linkstr;
				}
				$linkNodes = array();
			}
			$linkNodes[] = $beg;
        }
		if (count($linkNodes)) {
			$linkstr = $this->constructLink($this->m_name, $linkNodes);
			$outPut = $outPut . $linkstr;
		}

        if ($pos < strlen($this->m_str)) {
			$outPut = $outPut . substr($this->m_str, $pos);
        }
        return true;
    }
	
    public function getNodeText(&$nodeArray, &$txtLink) {
	
		global $СhapterSeparatorVerseOut;
		global $VerseSeparatorVerseOut;
	
		$node = $nodeArray[count($nodeArray)-1];
		switch ($node->GetType()) {
			case EndNode:
				$txtLink .= "&ndash;";
				break;
			case SubNode:
				$txtLink .= $СhapterSeparatorVerseOut;
				break;
			case RootNode:
				$txtLink .= ""; // Можно повторять название книги каждый раз, при указании новой главы
				break;
			case SingleNode:
				$txtLink .= $VerseSeparatorVerseOut;
				break;
			case NamedNode:
				$txtLink .= "&nbsp;";
				break;
		}
		$txtLink .= $nodeArray[count($nodeArray)-1]->GetNumber();

        return true;
    }

    public function Parse_(&$node, &$pos) {

		global $СhapterSeparatorVerseIn;
		global $VerseSeparatorVerseIn;
	
		$oldPos = $pos;
        $pos = $this->TrimStr($pos);
		$pos++;
        switch ($this->m_str[$pos-1]) {
        case '-':
                $node->SetType(EndNode);
                break;
        case $СhapterSeparatorVerseIn:
                $node->SetType(SubNode);
                break;
        case $VerseSeparatorVerseIn:
               $node->SetType(SingleNode);
               break;
        case ';':
               $node->SetType(RootNode);
               break;
        default:
			// поиск среднего и длинного тире в UTF-8, &ndash; и &mdash;
			if (ord($this->m_str[$pos-1]) == 226 && ord($this->m_str[$pos]) == 128 
				&& (ord($this->m_str[$pos+1]) == 147 || ord($this->m_str[$pos+1]) == 148)) {
				$pos++;
				$pos++;
				$node->SetType(EndNode);
                break;
			} elseif ($this->m_str[$pos-1] == '&' && ($this->m_str[$pos] == 'n' || $this->m_str[$pos] == 'm')
				&& $this->m_str[$pos+1] == 'd' && $this->m_str[$pos+2] == 'a' && $this->m_str[$pos+3] == 's' 
				&& $this->m_str[$pos+4] == 'h' && $this->m_str[$pos+5] == ';') {
				$pos += 6;
				$node->SetType(EndNode);
				break;
			} else {
            //$pos--;
			$pos = $oldPos;
            return false;
			}
        }
		if ($this->FillNode($node, $pos)) {
			return true;
		}
		//$pos--;
		$pos = $oldPos;
        return false;
    }

    public function  TrimStr($pos, $trimChar = "") {
		
		$str = substr($this->m_str, $pos);
		$currentSize = strlen($str);
		if ($trimChar == ".") {
			$str = ltrim($str, $trimChar);
		} else {
			$str = preg_replace('/^(&nbsp;| )+/', '', $str);
		}
		return $pos + ($currentSize - strlen($str));
    }

    public function GetInt(&$pos, &$n) {
		$str = substr($this->m_str, $pos);
		$h = sscanf($str, "%d", $n);
		if ($h != 1) {
			return false;
		}
		$pos = $pos + strlen((string)$n);
		return true;
    }

    // read number from str and set in node
    public function FillNode(&$none, &$pos) {
        $n;
        $pos = $this->TrimStr($pos);
       
		if ($this->GetInt($pos, $n)) {
            $none->SetNumber($n);
        } else {
			return false;
        }
        return true;
    }
}

// Разбивка строки на части, где каждая часть содержит одну именнованую книгу
// $str - входная строка, $v - выходной вектор подстрок, $vNames - выходной вектор имен книг

function CreateLinkBlocks(&$str, &$v, &$vNames) {
	
	$books = GetBibleBooks($type = 'all');
	$pos = 0;
	$posBegin = false;
	$name = "";
	$ifFind = false;
	$posToReturn = 0;
	
	do {
		$ifFind = false;
		$minPos = false;
		$minPosBook = "";
		// Перед поиском строки приводятся к нижнему регистру
		$strLower = ucwords(mb_strtolower($str, 'UTF-8'));
		//$strLower = $str;
		foreach ($books as $book => $index) {
			$finder = ucwords(mb_strtolower($book, 'UTF-8')) . " ";
			//$finder = $book . " ";
			$posBegin = strpos($strLower, $finder, $pos); // stripos и mb_stripos не отрабатывают
			
			if ($posBegin !== false) {
				if ($minPos === false) {
					$minPos = $posBegin;
					$minPosBook = substr($str, $posBegin, strlen($finder)-1);
					//$minPosBook = $book;
				} else if ($minPos > $posBegin) {
					$minPos = $posBegin;
					//$minPosBook = $book;
					$minPosBook = substr($str, $posBegin, strlen($finder)-1);
				}
			}
		}
		$posBegin = $minPos;
		if ($posBegin !== false) {
			if ($pos > 0) {
				$v[] = substr($str, $pos, $posBegin - $pos);
				$vNames[] = $name;
			} else {
				$posToReturn = $posBegin;
			}
			$name = $minPosBook;
			$pos = $posBegin + strlen($minPosBook);
			$ifFind = true;
		}
		
	} while ($ifFind);

	if ($name) {
		$v[] = substr($str, $pos, strlen($str) - $pos);
		$vNames[] = $name;
	}
	
    return $posToReturn;
}

function SearchBibleLinks($str) {
    $v;
	$vNames;
    $pos = CreateLinkBlocks($str, $v, $vNames);
    $output = substr($str, 0, $pos);
	
    for ($i=0; $i < count($v); $i++){
		$w = new CNodeWrapper($vNames[$i], $v[$i]);
		$t = $w->Parse();
		if ($t) {
			$output = $output . $t;
		} else {
			//$output = $output . "<b>" . $vNames[$i] . $v[$i] . "</b>" ;
			$output = $output . $vNames[$i] . $v[$i] ;
		}
    }
	return $output;
}

	echo $str.'<br/>'.SearchBibleLinks($str).'<br/>';
	
	// add_filter('the_content', 'SearchBibleLinks');
	
?>