<?php
/* Тестовые данные */
$str = '1. Иов.                 4:5,      6,      7; 8:1<br/>
2. Иова 4<br/>
3. Флм. 5 и Флм. 1:5<br/>
4. Иова 4:6 <br/>
5. Иова4:6а<br/>
6. Иова 4:6б<br/>
7. 1 Кор. 5:3-4<br/>
8. 1 Кор. 5:3&ndash;4 ndash<br/>
9. 1 Кор. 5:3&mdash;4 mdash<br/>
10. 1 Кор. 5:3-4 <br/>
11. 1 Кор. 5:3–4<br/>
12. 1 Кор. 5:3—4<br/>
13. 2 Кор 5:3-4 a<br/>
14. 2 Кор5:3-4<br/>
15. 2 Кор.5:3-4 a<br/>
16. 2 Кор.  5:3 - 4, 6,&nbsp;7,8,9<br/>
17. 2 Кор.&nbsp;5:3-4<br/>
18. 2 Кор. &nbsp;5:3-4<br/>
19. 2 Кор.&nbsp; 5:3-4<br/>
20. 2&nbsp;Кор.&nbsp;5:3-4<br/>
21. 2 Тим. 1:7 a<br/>
22. 2&nbsp;Кор. 5:3-4<br/>
23. 1 Цар. 5:3–4<br/>
24. 1 Кор. 5:3–4,6<br/>
25. 1 Кор. 5:3–4,6–7,8<br/>
26. 1 Кор. 5:3–4,6,7,8,9<br/>
27. Быт 1:2<br/>
28. Быт. 1:2<br/>
29. Бт 1:2<br/>
30. Книга Бытие 1:2<br/>
31. Четвертая книга Царств 1:2<br/>
32. Книга судей израилевых 1:2<br/>
33. Книга судей 1:2<br/>
33. Книга руфь 1:2<br/>
34. II Кор. 5:3-4<br/>
35. I Цар. 17:34–41<br/>
36. I Паралипоменон 14:9<br/>
37. Исследуйте другие отрывки Числ. 13:26–33 Священного Писания, которые говорят о страхе. Бог Велик, Писание призывает верующих бояться только Его (Исх. 23:32,33; Числ. 13:26–33; 14:9; Втор. 31:12,13; 1 Цар. 17; 4 Цар. 17:34–41; Иов. 38–42; Пс. 22:4; 55:2–4; 61; 90; 118:120; 120; Притч. 10:24; 28:1; 29:25; Ис. 8:11–14; 51:7–8; 57:11; Иер. 17:5–10; Дан. 1,3,4,6; Мф. 10:28–39; Лк. 12:4,5; 1 Петр. 3:6,13,14; Рим. 8:15; 2 Тим. 1:7).<br/>
38. Исследуйте другие отрывки Священного Писания, которые говорят о страхе. Бог Велик, Писание призывает верующих бояться только Его (Исх.&nbsp;23:32,33; Числ. 13:26–33; 14:9; Втор.&nbsp;31:12,13; 1 Цар. 17; 4 Цар. 17:34–41; Иов. 38–42; Пс. 22:4; 55:2–4; 61; 90; 118:120; 120; Притч. 10:24; 28:1; 29:25; Ис.&nbsp;8:11&ndash;14; 51:7&ndash;8; 57:11; Иер. 17:5–10; Дан. 1,3,4,6; Мф. 10:28–39; Лк. 12:4,5; 1&nbsp;Петр.&nbsp;3:6,13,14; Рим. 8:15; 2 Тим. 1:7).<br/>
39. Через старейшин Откровение откровение проблемам<br/>
40. Проверка разделителей: Мф. 3:4–6,8 (рус.) и Мт. 3,4–6.8 (укр.)
<br/><br/>';
/* */
?>